[{"date":"2","type":"Hostage taking, Shooting","dead":"147+ (+4)","injured":"79","location":"Garissa, Kenya","details":"Garissa University College attack: Six to ten gunmen associated with the Islamic terrorist group Al-Shabaab open fired at the Garissa University in Kenya. Christians were their main target of the attack, with the Islamic extremists separating the Muslims from Christians before executing them. Up to three hundred students are unaccounted for. One hundred and forty-seven students were reported killed, with fears the toll will rise, along with seventy-nine wounded. Four gunmen were killed by security forces.[1][2]","perpetrator":"Al-Shabaab","partOf":"War in Somalia"},{"date":"2","type":"Ambush","dead":"5","injured":"7","location":"Kashmir, India","details":"Gunmen attacked Indian forces in northeastern India and Kashmir on Thursday, killing five security personnel and wounding seven other people.[3]","perpetrator":"Unknown","partOf":"Kashmir conflict"},{"date":"2","type":"Ambush","dead":"3","injured":"4","location":"Arunachal Pradesh, India","details":"An ambush of an army convoy in Arunachal Pradesh in the remote northeast killed three soldiers and wounded four others.[3]","perpetrator":"Unknown","partOf":""},{"date":"3","type":"Car bomb","dead":"17","injured":"0","location":"Sinai, Egypt","details":"Around 15 Egyptian soldiers and 2 civilians were killed by gunshots and car bombs.","perpetrator":"Unknown","partOf":"Sinai insurgency"},{"date":"6","type":"Mass shooting, arson","dead":"24","injured":"Unknown","location":"Kwajaffa, Nigeria","details":"Up to two dozen militants associated with Boko Haram set fire to a local village and fired upon the villagers at a mosque. The attackers were disguised as preachers and claimed they had come to preach to the villagers.[4] Up to two dozen are thought to be killed and an unknown number wounded.[5]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"8","type":"Ambush","dead":"2","injured":"0","location":"Riyadh, Saudi Arabia","details":"Unknown militants shot and killed two patrolling policemen killed in Riyadh No group claimed responsibility but the Islamists groups Al-Qaeda and ISIL are suspected.[6]","perpetrator":"Al-Qaeda and |ISIL (suspected)","partOf":""},{"date":"10","type":"Car bomb","dead":"3","injured":"12","location":"Baghdad, Iraq","details":"A car bomb blast in Baghdad kills at least three people and injures 12.","perpetrator":"Unknown","partOf":"Iraqi Civil War (2014–2017)"},{"date":"11","type":"Car bomb","dead":"0","injured":"7","location":"Ko Samui, Thailand","details":"A car bomb in the tourist island of Ko Samui was detonated in the basement of a local mall. Seven were injured with no deaths accounts. Multiple vehicle in the vicinity were damaged[7]","perpetrator":"Local Islamic insurgency group","partOf":"South Thailand insurgency"},{"date":"11","type":"Mass shooting","dead":"20","injured":"0","location":"Baluchistan, Pakistan","details":"Gunmen entered a construction site and shot 20 workers whom they have identified as foreigners. The Baluch Liberation Front claimed responsibility for the attack.[8]","perpetrator":"Baluch Liberation Front","partOf":"Baluchistan conflict"},{"date":"12","type":"Bombing","dead":"6","injured":"2","location":"near Sheikh Zuweid, Sinai, Egypt","details":"Ansar Bait al-Maqdis militants attacked an armoured vehicle near Sheikh Zuweid, killing 6 soldiers and injuring another 2.[9]","perpetrator":"Ansar Bait al-Maqdis (ISIL)","partOf":"Sinai insurgency"},{"date":"12","type":"Bombing","dead":"8","injured":"45","location":"Arish, Sinai, Egypt","details":"Ansar Bait al-Maqdis detonated a bomb outside a police station in Al-Arish. The attack killed 8 people and injured another 45.[9]","perpetrator":"Ansar Bait al-Maqdis (ISIL)","partOf":"Sinai insurgency"},{"date":"13","type":"Shooting, Ambush","dead":"5","injured":"Unknown","location":"Chhattisgarh, India","details":"5 Chhattisgarh Armed Force (CAF) Jawans were killed in a Maoist ambush near Kirandul, Dantewada, Chhattisgarh","perpetrator":"Naxalites","partOf":"Naxalite–Maoist insurgency"},{"date":"14","type":"Car bomb","dead":"17","injured":"55","location":"Baghdad, Iraq","details":"Six car bombs were set off in multiple areas throughout Baghdad. Seventeen people were killed with more than fifty-five wounded. The ISIL is thought to be behind the attack.[10]","perpetrator":"ISIL (suspected)","partOf":"Iraqi Civil War (2014–2017)"},{"date":"14","type":"Shooting, bombing","dead":"10-20 (+3-7)","injured":"20","location":"Mogadishu, Somalia","details":"Al-Shabaab militants attacked a Somalian government building with small arms and bombs. Somali officials say that 10-15 civilians and 7 perpetrators were killed while Al-Shabaab say that they have killed 20 people and only 3 perpetrators were killed. Somali official said that 20 people were injured.[11]","perpetrator":"Al-Shabaab","partOf":"War in Somalia"},{"date":"14","type":"Ambush","dead":"11","injured":"20","location":"Buenos Aires, Cauca, Colombia","details":"An ambush by the FARC left 11 dead and 20 injured.[12]","perpetrator":"FARC","partOf":"Colombian conflict"},{"date":"15","type":"Vehicular attack","dead":"1","injured":"1 (+1)","location":"East Jerusalem","details":"Thirty-seven-year-old Khaled Koutineh rammed his car into Israelis waiting at a bus stop in the French Hill, killed twenty-five-years-old Shalom Yochai Sherki and injured another twenty-years-old Shira Klein. The attack occurred in the Eve of Holocaust Remembrance Day.[13]","perpetrator":"Khaled Koutineh (Lone wolf)","partOf":"Israeli–Palestinian conflict"},{"date":"17","type":"Bombing","dead":"3","injured":"5","location":"Erbil, Iraq","details":"A car bomb killed three and wounded five outside the US consulate in Erbil, Iraq. ISIL claimed responsibility for the attack.[14]","perpetrator":"ISIL","partOf":"Iraqi Civil War (2014–2017)"},{"date":"18","type":"Suicide bombing","dead":"33","injured":"115","location":"Jalalabad, Afghanistan","details":"April 2015 Jalalabad suicide bombing A suicide bomber set off a bomb outside a state run bank. Thirty-three were killed along with one hundred and fifteen wound. ISIL took credit for the attack.[15]","perpetrator":"ISIL","partOf":"War in Afghanistan"},{"date":"19","type":"Shooting","dead":"1","injured":"0","location":"Villejuif, France","details":"Unsuccessful attack against 2 churches in Villejuif by an Algerian jihadist. He killed a woman probably when trying to steal her car but accidentally shot himself in the leg, putting an end to his plans.[16]","perpetrator":"Islamist Lone Wolf","partOf":"Wave of Terror in Europe"},{"date":"20","type":"Bombing","dead":"7","injured":"8","location":"Garoowe, Somalia","details":"Militants associated with Al-Shabaab detonated a bomb in a United Nations bus in the Northern town of Garoowe. Two Kenyans, one Ugandan, one Afghan and three Somalis were killed and one American, one Sierra Leonean, one Ugandan, one Kenyan and four Somalis were wounded. Four UNICEF workers were among the dead.[17]","perpetrator":"Al-Shabaab","partOf":"War in Somalia"},{"date":"21","type":"Shooting,bombing","dead":"9 (+1)","injured":"14 (+2)","location":"Savar Upazila, Bangladesh","details":"The ABT was implicated in a bank robbery of a branch of the Bangladesh Commerce Bank Limited in Ashulia of Savar on April 21, 2015. The robbery started at 3 pm, when 8-10 people entered the bank brandishing guns. According to witness reports, they tried to take Tk. 5 lakhs (US$6,400 as of June 2015) while holding bank officials hostage at gunpoint. However, as some of the officials obstructed the robbers, they were stabbed, injuring 5 of which 3 succumbed to their injuries in medical care.However, at that point, locals outside quickly used a nearby mosque with loudspeakers to announce the bank robbery. The robbers heard the announcements and started violently fleeing the area, using several rounds of shots, hurling molotov cocktails and grenades. This sudden outburst injured some 20 people; 3 of whom died immediately after hospital admission, 2 later while receiving treatment at around 8:30 pm and one more person on the next night.The robbers divided and fled the scene, some on foot and some on motorcycles. A mob quickly formed and caught 2 robbers on one bike and another robber in another area. In a mass beating of the two caught, the mob killed one and hospitalised the other – who later succumbed to his injuries. The police attempted to recover the robbers but this led to a clash and two police vehicles being vandalised. Arrival of police backup put the situation under control and the robbers captured.A total of 9 people were either killed immediately or succumbed to injuries sustained, and at least 14 others were at most injured by bullet-wounds from weapons used by the robbers. Interrogation of the captured robber(s) led to the arrest of more suspects; police found that several of the robbers were members of the ABT.[18][19]","perpetrator":"Ansarullah Bangla Team","partOf":""},{"date":"21","type":"Raid","dead":"0","injured":"0","location":"Lipkovo, Republic of Macedonia","details":"Gošince attack:40 armed men took over a police station at the border of Kosovo, tied the policemen and beat them the policemen and stole arms and equipment.","perpetrator":"NLA","partOf":""},{"date":"22","type":"Suicide bombing","dead":"8","injured":"16","location":"Balad, Iraq","details":"Eight pilgrims returning from a Shiite shrine in Samarra were killed in a suicide bombing; 16 others were injured.[20]","perpetrator":"Islamic State","partOf":"Iraqi Civil War (2014–2017)"},{"date":"27","type":"Shooting","dead":"1 (+1)","injured":"2","location":"Zvornik, Bosnia and Herzegovina","details":"Zvornik police station terrorist attack: At the police station in Zvornik, Republika Srpska, an armed member of a wahhabist movement opened fire on the police. In the shooting, a police officer was killed, two others were injured, and the attacker was eliminated by police.[21]","perpetrator":"Wahhabist movement","partOf":"Wave of Terror in Europe"}]