[{"date":"1","type":"Suicide bombing","dead":"20","injured":"29","location":"Kabul, Afghanistan","details":"2016 Kabul suicide bombing: A suicide bomber blew himself within a queue at the entrance of the headquarters of the Afghan National Civil Order Police in Kabul. The blast killed at least 20 people and another 29 were injured. Taliban claimed responsibility.[1]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"1","type":"Bombing","dead":"7","injured":"5","location":"Hīt, Iraq","details":"children are among those eliminate by two mujahideen bomb blast. 7 dead 5 injured.","perpetrator":"Islamic State","partOf":"Iraqi Civil War"},{"date":"1","type":"beheading","dead":"3","injured":"0","location":"Manbij, Syria","details":"three brothers are beheaded by the Islamic state.","perpetrator":"Islamic State","partOf":"Syrian Civil War"},{"date":"2","type":"Bombing","dead":"0 (+1)","injured":"2","location":"Somalia","details":"Daallo Airlines Flight 159: 20 minutes after take-off, a passenger in Daallo Airlines Flight 159, detonated an explosive device in the Airbus A321, opening a hole in the fuselage behind the R2 door. The crew turned the plane around and successfully performed an emergency landing at Mogadishu's Aden Adde International Airport. Two injuries were reported and another body, believed to be that of the perpetrator was found on the ground in Somalia.","perpetrator":"al-Shabaab","partOf":"War in Somalia"},{"date":"3","type":"Shooting, melee attack","dead":"1 (+3)","injured":"2","location":"Jerusalem, Israel","details":"Three Palestinians from Jenin, armed with rifles, knives and IEDs and were stopped by Magav policewoman in Nablus gate, Jerusalem when one of them pulled a gun shot her and other policemen, killing one policewoman and wounding another two. The assailants were all shot dead by other security forces in the area. No group claimed responsibility.[2]","perpetrator":"Palestinian lone wolf","partOf":"Israeli–Palestinian conflict"},{"date":"3","type":"Artillery","dead":"15","injured":"58","location":"Daraa, Syria","details":"Syrian rebel group fired rockets on residential neighbourhoods in Daraa, Syria. At least 15 civilians were killed and another 58 were wounded, including 8 in serious condition. No specific group claimed responsibility.[3]","perpetrator":"Syrian rebel group","partOf":"Syrian Civil War"},{"date":"4","type":"Car bombings","dead":"28","injured":"Unknown","location":"Fallujah and Ramadi, Iraq","details":"A car bomb a barracks in Fallujah and another car bomb at a government base in Ramadi killed 28 troops all together. Both cities were sieged by ISIS at the time.[4]","perpetrator":"Islamic State","partOf":"Iraqi Civil War"},{"date":"5","type":"Car bombing","dead":"3","injured":"Unknown","location":"Aden Adde International Airport, Somalia","details":"A car bomb was detonated in Aden Adde International Airport, killing two men and one woman and injuring several others. The attack is believed to have targeted a Somali airport official, who went unharmed. No group claimed responsibility but Al-Shabaab is suspected.[5]","perpetrator":"Al-Shabaab (suspected)","partOf":"War in Somalia"},{"date":"5","type":"Attack","dead":"1 (+4)","injured":"Unknown","location":"Timbuktu, Mali","details":"Militants attacked a MINUSMA police base in northern Malian city of Timbuktu and captured it for a brief time until it was recaptured by Malian troops backed by UN helicopters. A Malian commender and four militants were killed. al-Qaeda in the Islamic Maghreb claimed responsibility.[6]","perpetrator":"al-Qaeda in the Islamic Maghreb","partOf":"Northern Mali conflict"},{"date":"6","type":"Suicide bombing","dead":"9","injured":"34","location":"Quetta, Pakistan","details":"A suicide bomber blew himself at a security forces vehicle in Quetta, killing nine people, including two Frontier Corps (FC) personnel and wounding another thirty-four. Tehreek-i-Taliban Pakistan claimed responsibility.[7]","perpetrator":"Tehreek-i-Taliban Pakistan","partOf":"War in North-West Pakistan"},{"date":"6","type":"Bombing","dead":"4","injured":"10+","location":"Bujumbura, Burundi","details":"Four people have been killed in Burundi in a grenade attack on a bar in the capital Bujumbura, officials say. Among the victims was a child selling boiled eggs. Ten other people were injured in Saturday's attack. Unknown attackers also threw grenades at an army patrol and at police in Bujumbura, hurting several people.[8]","perpetrator":"Unknown","partOf":"Burundian unrest"},{"date":"8","type":"Suicide bombing","dead":"3 (+1)","injured":"8-14","location":"Mazar-i-Sharif, Afghanistan","details":"A suicide bomber detonated a suicide vest near a bus, carrying members of the Afghani army's 209th Shaheen Corps. Three people were killed. The Afghani government said eight were injured while the provincial governor said fourteen were injured, including three women, all military employees. The Taliban claimed responsibility.[9]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"8","type":"Suicide bombing","dead":"6 (+1)","injured":"9","location":"Yahyakhel District, Afghanistan","details":"A suicide bomber blew himself outside a bakery shop in Yahyakhel District of Paktika province, an area near Afghanistan's eastern border with Pakistan. The suicide bomber apparently targeted police and government employees buying bread. No group claimed responsibility.[9]","perpetrator":"Unknown","partOf":"War in Afghanistan"},{"date":"8","type":"Execution","dead":"300","injured":"0","location":"Mosul, Iraq","details":"2016 Mosul attack: Islamic State have executed over 300 police and army personal, as well as civil activists by firing squad in Mosul.[10]","perpetrator":"Islamic State","partOf":"Iraqi Civil War"},{"date":"9","type":"Suicide bombing","dead":"8 (+1)","injured":"20","location":"Damascus, Syria","details":"A suicide car bomber blew himself up in a parking lot at a police officers' club in a residential district of Damascus. The Islamic State claimed responsibility, saying the motive was \"to avenge what it called the suffering of fellow Sunni Muslims.\"[11]","perpetrator":"Islamic State","partOf":"Syrian Civil War"},{"date":"9","type":"Suicide bombing","dead":"6 (+2)","injured":"30","location":"Cameroon","details":"Two Boko Haram suicide bombers attacked a Muslim funeral gathering in northern Cameroon 10 km (6 miles) east to the Nigerian border. Six civilians were killed and another thirty were wounded. It is the first known Boko Haram strike in Cameroon at a funeral gathering, although the militants have made an attack on a baptism in the past.[12]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"9","type":"Suicide bombing","dead":"60","injured":"78","location":"Dikwa, Nigeria","details":"Two female suicide bombers sneaked into an internally displaced persons (IDP) camp and detonated themselves in the middle of it in the northeast Nigerian town of Dikwa The blasts killed 60 people and wounded another 78. No group claimed responsibility but Boko Haram is suspected.[13]","perpetrator":"Boko Haram (suspected)","partOf":"Boko Haram insurgency"},{"date":"11","type":"Shooting","dead":"0 (+1)","injured":"4","location":"Columbus, Ohio,  United States","details":"2016 Ohio machete attack: An attacker injures 4 in machete attack at a restaurant; attacker was shot and killed by police when he attacked police at the end of a car chase.","perpetrator":"Islamic terrorist (suspected)","partOf":""},{"date":"11","type":"Attack","dead":"3","injured":"0","location":"Mopti, Mali","details":"Suspected Islamist militants attacked a customs post in the town of Mopti, central Mali, killing two civilians and a customs officer.[14]","perpetrator":"Unknown","partOf":"Northern Mali conflict"},{"date":"11","type":"Shooting","dead":"6","injured":"0","location":"Kandahar, Afghanistan","details":"Four policemen are killed and another seven wounded when one of their colleagues opened fire on them in Kandahar, Afghanistan.[15]","perpetrator":"Policemen","partOf":"War in Afghanistan"},{"date":"12","type":"Truck bomb, mortar fire","dead":"5","injured":"30","location":"Kidal, Mali","details":"An attack by suspected Islamist militants on a MINUSMA base in the town of Kidal, northern Mali, kills at least 5 United Nations peacekeepers and injures 30 others.[16]","perpetrator":"Ansar Dine","partOf":"Northern Mali conflict"},{"date":"12","type":"Shooting","dead":"5","injured":"0","location":"Aden, Yemen","details":"At least five policemen are killed in an attack on a police station in Aden.[17]","perpetrator":"Unknown","partOf":"Yemeni Civil War"},{"date":"12","type":"Attack","dead":"8","injured":"Unknown","location":"Kahifa, Nigeria","details":"Members of Boko Haram attacked a village near Kachifa, killing eight people.[18]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"13","type":"Melee attack","dead":"0 (+1)","injured":"2","location":"Cave of the Patriarchs, Hebron","details":"A Palestinian assailant tried to stab Israeli soldiers stationed near the Cave of the Patriarchs in Hebron in the West Bank. A soldier was slightly wounded, the terrorist, a Hebron resident aged 17, was killed. In the incident, a Palestinian was wounded and evacuated to Shaarei Tzedek hospital in Jerusalem.[19]","perpetrator":"Kalzar al-Uweiwi (Palestinian lone wolf)","partOf":"Israeli–Palestinian conflict"},{"date":"13","type":"Bombing","dead":"2","injured":"1","location":"Sinai, Egypt","details":"A roadside bomb exploded when Egyptian soldiers were trying to defuse it. Two soldiers, including an officer were killed and another one was wounded. No group claimed responsibility for planting the bomb but IS–linked Wilayat Sayna is suspected.[20]","perpetrator":"IS-linked Wilayat Sayna (suspected)","partOf":"Sinai insurgency"},{"date":"13","type":"Vehicular attack","dead":"0","injured":"4 (+3)","location":"Ma'ale Adumim, West Bank","details":"Four border police were slightly injured on Saturday in a car ramming attack, outside a military base near Ma'ale Adumim, east of Jerusalem, in the West Bank. Police say the suspects continued driving after shots had been fired, and slammed into the vehicle of a second police team, before they were apprehended. Two of the Palestinian suspects were lightly wounded and a third suffered moderate injuries.[21]","perpetrator":"Palestinians lone wolf","partOf":"Israeli–Palestinian conflict"},{"date":"13","type":"Suicide bombing","dead":"Unknown","injured":"Unknown","location":"Helmand Province, Afghanistan","details":"Several Sangin security force members are killed by Taliban suicide attacks, using captured military Humvee vehicles, in the southern Afghan province of Helmand.[22]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"13","type":"Attack","dead":"22","injured":"Unknown","location":"Yakshari, Nigeria","details":"Members of Boko Haram attacked Yakshari, killing 22 people.[18]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"15","type":"Car bomb","dead":"2","injured":"17","location":"Derbent, Russia","details":"A car bomb killed at least 2 people and 17 others were injured in Derbent, a city in the Republic of Dagestan. The Islamic State claimed responsibility for the attack.[23]","perpetrator":"Islamic State","partOf":"Insurgency in the North Caucasus"},{"date":"15","type":"Car bomb","dead":"1","injured":"1","location":"Mogadishu, Somalia","details":"Muhidin Mohamed, former Somali defense minister, died in the explosion of a bomb, placed in his car in Mogadishu. Another person was also wounded in the attack. No group claimed responsibility, but Al-Shabaab is suspected.[24]","perpetrator":"Al-Shabaab (suspected)","partOf":"War in Somalia"},{"date":"17","type":"Suicide bombing","dead":"13","injured":"60","location":"Aden, Yemen","details":"A suicide bomber kills at least 13 recruits at a Yemeni Army base run by forces loyal to ousted President Abd Rabbuh Mansur Hadi in the southern port city of Aden. The Islamic State claimed responsibility for the attack.[25]","perpetrator":"Islamic State","partOf":"Yemeni Civil War"},{"date":"17","type":"Suicide car bombing","dead":"30","injured":"61","location":"Ankara, Turkey","details":"February 2016 Ankara bombing: At least 30 people died and 61 were injured in the Turkish capital. The attack targeted the army buses near the central square of Kizilay. Many ministries, the headquarters of the army and the Turkish parliament are in this neighbourhood. The Turkish news channels showed images of a raging fire that engulfed military vehicles. The explosion was audible several kilometers away.[26]","perpetrator":"Kurdistan Freedom Falcons","partOf":"Kurdish–Turkish conflict"},{"date":"18","type":"Bombing","dead":"6","injured":"1","location":"Diyarbakır, Turkey","details":"2016 Diyarbakır bombing: A bomb killed at least 6 soldiers and another were injured. The attack occurred on 18 February 2016 in Diyarbakır a city in Diyarbakır Province.[27]","perpetrator":"Kurdistan Freedom Falcons","partOf":"Kurdish–Turkish conflict"},{"date":"18","type":"Melee Attack","dead":"1","injured":"0","location":"Manchester, United Kingdom","details":"An Imam is beaten to death by two ISIS supporters for practicing \"black magic\".[28]","perpetrator":"Islamic State inspired lone wolves","partOf":"Wave of Terror in Europe"},{"date":"18","type":"Melee attack","dead":"1","injured":"1 (+2)","location":"Sha'ar Binyamin Industrial Zone, West Bank","details":"Two 14-year-old Palestinians entered a Rami Levi supermarket and stabbed two Israelis, killing one and wounding the other. Other shoppers confronted the assailants, and a civilian, who carried a firearm, shot and wounded the assailants.[29]","perpetrator":"Palestinians lone wolf","partOf":"Israeli–Palestinian conflict"},{"date":"19","type":"Suicide bombing","dead":"24","injured":"112","location":"Meme, Cameroon","details":"Two suicide bombers attacked a market in the northern Cameroon region of Meme. 24 people were killed in the blast and another 112 injured. No group claimed responsibility, but Boko Haram is suspected.[30]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"19","type":"Attack","dead":"3","injured":"0","location":"Diyarbakir, Turkey","details":"At least 2 soldiers and one police officer die in an PKK attack in Diyarbakir.[31]","perpetrator":"PKK","partOf":"Kurdish–Turkish conflict"},{"date":"19","type":"Melee attack","dead":"0 (+1)","injured":"2","location":"Jerusalem, Israel","details":"Two Israelis were injured in a stabbing attack at Jerusalem's Damascus gate in the Old City. The attacker was shot and killed.[32]","perpetrator":"Palestinian lone wolf","partOf":"Israeli–Palestinian conflict"},{"date":"20","type":"Shooting","dead":"2 (+2)","injured":"10","location":"Srinagar, India","details":"Several gunmen attacked a paramilitary convoy in Indian Kashmir, killing two soldiers, after they fired on an office building, where there were one hundred people. They also injured ten people. Two attackers were killed.[33]","perpetrator":"Unknown","partOf":"Kashmir Conflict"},{"date":"20","type":"Siege","dead":"8","injured":"11+","location":"Jammu and Kashmir, India","details":"Three terrorists attacked a Central Reserve Police Force convoy and took shelter in the Jammu & Kashmir Entrepreneurs Development Institute. Security forces and the terrorists exchanged fire. All three terrorists were killed, along with three army soldiers, a gardener at the institute, and a civilian.","perpetrator":"Lashkar-e-Taiba","partOf":"Unknown"},{"date":"21","type":"Bombing","dead":"57","injured":"100+","location":"Homs, Syria","details":"February 2016 Homs bombings: Two bombings occurred in pro-Government, mainly Shia inhabited, Zahraa neighbourhood in Homs. The first blast was caused by a car bomb and the second one was a result of a car bomb or a suicide bombing. 57 people were killed and at least 100 wounded. Islamic State claimed responsibility.[34][35]","perpetrator":"Islamic State","partOf":"Syrian Civil War"},{"date":"21","type":"Bombing","dead":"134 (+2)","injured":"180","location":"Sayyidah Zaynab, Syria","details":"February 2016 Sayyidah Zaynab bombings : Islamic State militants detonated a car bomb and later launched two suicide bombings, about 400 meters from Sayyidah Zaynab Mosque, a Shia shrine, believed to contain the grave of Prophet Muhammad's granddaughter. 83 to 134 people were killed and 180 wounded, including children. Syrian media said the attack occurred when pupils were leaving school in the area. At least 60 shops were damaged as well as cars in the area. Islamic State claimed responsibility.[36][37]","perpetrator":"Islamic State","partOf":"Syrian Civil War"},{"date":"21","type":"Melee attack,bombing","dead":"1","injured":"2","location":"Panchagarh District, Bangladesh","details":"On 21 February 2016, so-called Islamic State group has said it was behind the beheading of Jogeshwar Roy, a senior Hindu priest and wounding two worshippers in Panchagarh district of northern Bangladesh.[38]","perpetrator":"Islamic State","partOf":""},{"date":"21","type":"Land mine","dead":"2","injured":"10+","location":"Arish, Sinai, Egypt","details":"On February 21, two civilians were killed and around ten people were injured, including policemen and passersby after an armored vehicle drove on an explosive device planted on a roadside in Arish. No group claimed responsibility, but Islamic State affiliated Wilayat Sayna is suspected.[39]","perpetrator":"Wilayat Sayna (suspected)","partOf":"Sinai Insurgency"},{"date":"22","type":"Bombing","dead":"1","injured":"38","location":"Esperanza, Sultan Kudarat, Philippines","details":"Two attackers on motorcycles threw two grenades into a crowd. The attack in the town of Esparanza wounded 38 people and killed a child of six years.[40]","perpetrator":"Unknown","partOf":"Civil conflict in the Philippines"},{"date":"22","type":"Suicide bombing","dead":"14","injured":"11","location":"Parwan Province, Afghanistan","details":"A suicide bomber kills at least 14 people including 8 civilians and 6 police officers. Another 11 people were injured. The bombing took place in Parwan Province, Afghanistan. The Taliban claimed responsibility for the attack.[41]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"22","type":"Bombing","dead":"2","injured":"9","location":"Bujumbura, Burundi","details":"Assailants on a motorcycle threw three grenades into a crowd. The first grenade was thrown at Kwa Siyoni market in the district of Ngagara (north of the capital), killing one person and wounding seven. A second exploded in the market Kamenge (northeast) also killing one person and injuring two, followed by a third grenade, launched in Butere district (north-west of the capital), which has no injuries. This new killer episode comes a few hours after the arrival of the Secretary-General of the United Nations, Ban Ki-moon. Three men were arrested in connection with the attacks.[42]","perpetrator":"Unknown","partOf":"Burundian unrest"},{"date":"23","type":"Bombing","dead":"0","injured":"2-10","location":"Bujumbura, Burundi","details":"During the night of February 23, assailants threw ten grenades in deserted places of the city or on soldiers. Two soldiers were wounded in the Mutakura and another in the Musaga district. Relating the count of injured civilians, authorities said \"a dozen\".[43]","perpetrator":"Unknown","partOf":"Burundian unrest"},{"date":"24","type":"Melee attack","dead":"1","injured":"0(+1)","location":"Gush Etzion Junction, West Bank","details":"An Israeli is in serious condition after being stabbed in the chest at the Gush Etzion Junction in the West Bank south of Jerusalem. According to initial reports the attacker was shot and moderately injured.[44]","perpetrator":"Palestinian lone wolf","partOf":"Israeli–Palestinian conflict"},{"date":"24","type":"Shooting","dead":"3","injured":"2 (+2)","location":"Léré, Mali","details":"Gunmen attack a Malian military checkpoint in the town of Léré, near the Mauritanian border with Mali, killing at least three soldiers and wounding two others.[45]","perpetrator":"Unknown","partOf":"Northern Mali conflict"},{"date":"25","type":"Suicide bombing","dead":"15 (+2)","injured":"50","location":"Baghdad, Iraq","details":"A suicide bomber killed at least 15 people and 50 others were injured at Shi'ite mosque in Baghdad.[46]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"25","type":"Mortar attack","dead":"4","injured":"8","location":"Mogadishu, Somalia","details":"At least 4 people were killed and 8 others injured in an mortar attack in Mogadishu.[47]","perpetrator":"Al-Shabaab","partOf":"War in Somalia"},{"date":"26","type":"Suicide bombing, shooting","dead":"14 (+5)","injured":"Unknown","location":"Mogadishu, Somalia","details":"February 2016 Mogadishu attack: A suicide bomber blew the entrance of the SYL hotel in Mogadishu allowing gunmen to storm the hotel and clash with the hotel guards. Government forces arrived and ended the attack. Five militants, including the suicide bomber and at least nine civilians were killed. Al-Shabaab claimed responsibility.[48]","perpetrator":"Al-Shabaab","partOf":"War in Somalia"},{"date":"26","type":"Melee attack","dead":"0","injured":"1","location":"Ma'ale Adumim, West Bank","details":"an Israeli security officer of 47 years was stabbed outside a shopping center in the city of Ma'ale Adumim in the West Bank near Jerusalem on the night of Thursday, 25 to Friday, 26. The attacker managed to flee before the arrival of security forces at the scene of the incident.[49]","perpetrator":"Palestinian lone wolf","partOf":"Israeli–Palestinian conflict"},{"date":"26","type":"Suicide bombing","dead":"5 (+1)","injured":"Unknown","location":"Al-Hawari, Libya","details":"Five members of loyal forces of the Council of Deputies  were killed in a suicide attack in Al-Hawari near Benghazi. This attack was claimed by Islamic State.[50]","perpetrator":"Islamic State","partOf":"Second Libyan Civil War"},{"date":"26","type":"Land mine","dead":"1","injured":"Unknown","location":"Sidi Faraj, Libya","details":"One member of loyal forces of the Council of Deputies was killed in a land mine in Sidi Faraj near Benghazi. This attack was claimed by Islamic State.[50]","perpetrator":"Islamic State","partOf":"Second Libyan Civil War"},{"date":"26","type":"Melee attack","dead":"0","injured":"1","location":"Hanover, Germany","details":"Knife attack, one federal policeman was critically injured by a stabbing attack by 15-year-old girl Safia S. The attack would later be connected to ISIL.[51] The girl was in contact with the organisation.[52][53]","perpetrator":"Islamic State","partOf":"Wave of Terror in Europe"},{"date":"27","type":"Suicide bombing","dead":"13 (+1)","injured":"40","location":"Asadabad, Afghanistan","details":"At least 11 civilians were killed and 40 more injured in a suicide bombing in the city of Asadabad in Kunar province.[54]","perpetrator":"Unknown","partOf":"War in Afghanistan"},{"date":"27","type":"Car bomb","dead":"2","injured":"7","location":"Pattani, Thailand","details":"The attack was carried out by Islamist rebels. The bomb was placed in a stolen car, parked near a restaurant and a police station. The two dead were civilians, the seven wounded were policemen.[55]","perpetrator":"Unknown","partOf":"South Thailand insurgency"},{"date":"27","type":"Car bomb","dead":"2 (+1)","injured":"Unknown","location":"Salamiyah, Syria","details":"In the morning, the car exploded at the entrance of the city of Salamiyah in the Syrian province of Hama, killing two victims. The attack was claimed by the Islamic State.[56]","perpetrator":"Islamic State","partOf":"Syrian Civil War"},{"date":"27","type":"Suicide bombing","dead":"4 (+1)","injured":"Unknown","location":"Teeba, Syria","details":"A terrorist on a motorcycle blew himself up in the village of Teeba, killing four people. The attack was claimed by the Islamic State.[56]","perpetrator":"Islamic State","partOf":"Syrian Civil War"},{"date":"27","type":"Suicide bombing","dead":"9 (+1)","injured":"13","location":"Kabul, Afghanistan","details":"In Kabul, a suicide bombing near the Ministry of Defense was claimed by the Taliban killed more than nine people and injured 13 others.[57]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"27","type":"Bombing","dead":"2","injured":"2","location":"Rafah, Sinai, Egypt","details":"At least two Egyptian police officers have been killed and two others injured when a roadside bomb explosion struck their armored vehicle in the country's volatile Sinai Peninsula. Islamic State affiliated Wilayat Sayna claimed the responsibility.[58]","perpetrator":"Wilayat Sayna","partOf":"Sinai Insurgency"},{"date":"27","type":"Attempted arson","dead":"0","injured":"0","location":"Enschede, Netherlands","details":"Five right-wing extremists threw petrol bombs at a Moroccan mosque in an attempt to destroy the building while people were still inside.[59]","perpetrator":"Right-wing extremists","partOf":""},{"date":"28","type":"Bomb","dead":"78 (+2)","injured":"100+","location":"Sadr City Baghdad, Iraq","details":"February 2016 Baghdad bombings: Up to 70 people were killed and 60 wounded in Sadr City, a southern suburb of the Iraqi capital, as two bombs went off at a crowded market. The explosions ripped through a market selling mobile phones in the mainly Shiite Muslim district. The assailants were suicide bombers riding motorcycles through the crowd.[60]","perpetrator":"Islamic State","partOf":"Iraqi Civil War"},{"date":"28","type":"Suicide bombing","dead":"30+ (+2)","injured":"40+","location":"Baidoa, Somalia","details":"Two suicide bombers attacked a busy junction and a restaurant in the Somali town Baidoa. 17 people, mostly civilians were killed and another 25 were injured. Al-Shabaab claimed responsibility, saying they targeted government officials and security forces.[61][62]","perpetrator":"Al-Shabaab","partOf":"War in Somalia"},{"date":"28","type":"Shooting","dead":"1","injured":"0","location":"Arish, Sinai, Egypt","details":"A policeman was killed in North Sinai's al-Arish city in a shooting during the early hours of Sunday, said a source in the Interior Ministry. Unidentified masked men fired at the policeman outside his house, an official added. No group claimed responsibility, but Islamic State affiliated Wilayat Sayna is suspected.[39]","perpetrator":"Wilayat Sayna (suspected)","partOf":"Sinai Insurgency"},{"date":"29","type":"Melee attack","dead":"1","injured":"0","location":"Moscow, Russia","details":"A nanny was arrested in Moscow to have beheaded a 4-year-old child she was supposed to keep. His nanny, Gultchekhra Bobokoulova, 39, was arrested near a metro station in the northwest of Moscow with the head of the girl in a plastic bag, says this chain known for its links with the security services Russian. According to Interfax, the nanny is a native of Uzbekistan, former Soviet republic of predominantly Muslim Central Asia.[63]\nAccording to several witnesses quoted by Russian media, the nanny would have shouted \"Allah Akbar!\" at the time of the arrest.\n","perpetrator":"Gultchekhra Bobokoulova","partOf":""},{"date":"29","type":"Suicide car bombing","dead":"4 (+1)","injured":"5","location":"Aden, Yemen","details":"A suicide bomber driving a car bomb blew himself up amid a gathering of loyalist forces.[64]","perpetrator":"Unknown","partOf":"Yemeni Civil War"},{"date":"29","type":"Suicide bombing","dead":"40","injured":"58","location":"Muqdadiya, Iraq","details":"The death toll in a suicide bombing in Iraq's eastern province of Diyala rose to 24. A further 55 people were wounded in the attack at a funeral for a Shi'ite Muslim militia fighter in Muqdadiya, 80 km (50 miles) northeast of Baghdad.[65]","perpetrator":"Islamic State","partOf":"Iraqi Civil War"},{"date":"29","type":"Attack","dead":"13","injured":"0","location":"Ntombi, Democratic Republic of Congo","details":"Thirteen civilians were killed by suspected Ugandan rebels in the Beni territory in eastern DRC. The killings took place in the village of Ntombi, located about 40 km northeast of Beni, an area massacres and recurrent attacks attributed to Allied Democratic Forces, a rebel group opposed to the Ugandan government and is considered a terrorist organisation.[66]","perpetrator":"Allied Democratic Forces","partOf":"Allied Democratic Forces insurgency"},{"date":"29","type":"Suicide bombing","dead":"6 (+4)","injured":"7","location":"Haditha, Iraq","details":"Suicide bombers attacked late in the evening of 29 February the headquarters of the army in the Haditha area in the western province of Anbar, killing Brigadier Ali Abboud, Lt. Col. Farhan Ibrahim and four other military, Iraqi official sources reported. Seven other soldiers were injured.[67]","perpetrator":"Islamic State","partOf":"Iraqi Civil War"}]