[{"date":"1","type":"Shooting","dead":"1","injured":"0","location":"Mogadishu, Somalia","details":"Islamist militants opened fire on a group of aid workers, killing one.","perpetrator":"Al-shabaab","partOf":"War in Somalia"},{"date":"1","type":"Shooting","dead":"3","injured":"7","location":"Tel Aviv, Israel","details":"January 2016 Tel Aviv shooting: A Gunman identified as Arab-Israeli Nasha'at Melhem (via CCTV footage), fired into a crowded Pub and several other businesses in Dizingoff street in Tel Aviv, killing two civilians and wounding another seven. After fleeing the location, the attacker took a cab and then shot the driver dead.[1][2] Nasha'at Melhem was found by Israeli counter-terrorism forces in his hometown Ar'ara on 8 January 2016 and was shot dead after a shootout. No group claimed responsibility, but Israeli police forces suspect other people were involved in the incident. Selfie videos from his cell phone were later made public by the Shin Bet, with the videos leading officials to believe that the attack was inspired by ISIL.","perpetrator":"Nasha'at Melhem","partOf":"ISIL-inspired"},{"date":"1","type":"Shooting","dead":"1","injured":"0","location":"Diyala, Iraq","details":"Unknown gunman shot and killed an Iraqi soldier in near a village in Diyala Governorate, northeast to Baqubah.[3]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"1","type":"Suicide bombing","dead":"2 (+1)","injured":"15","location":"Kabul, Afghanistan","details":"Suicide bomber detonated himself in a French restaurant called 'Le Jardin', popular with foreigners that is located near a district with many foreign embassies and government buildings in Kabul, killing two people including a 12-year-old boy and wounding another 15. The blast also left a building engulfed in flames. Taliban claimed responsibility.[4]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"1","type":"Shooting","dead":"1","injured":"4","location":"Mogadishu, Somalia","details":"Gunmen opened fire near a mosque in Mogadishu killing one Somali man, and wounding four people including a Turkish citizen. The Turkish ministry of Foreign Affairs said the \"[...] attack was perpetrated against Turkish non-governmental organization workers that offer humanitarian aid in Mogadishu during noon hours.\" No group claimed responsibility, but Al-Qaeda-affiliated al-Shabaab are suspected.[5]","perpetrator":"al-Shabaab (suspected)","partOf":"War in Somalia"},{"date":"1","type":"Vehicular attack","dead":"0","injured":"2 (+1)","location":"Valence, France","details":"29-year-old Frenchman of Tunisian descent rammed over a civilian and a guard in an entrance of a mosque in Valence, Drôme, reportedly while chanting Allahu Akbar (Allah is the greatest). He then put his car into reverse to try to ram the soldiers again who fired warning shots and then fired to disable the driver. The driver said he wanted to kill troops because \"troops killed people\" and that he wanted to be killed by the troops.[6]","perpetrator":"Lone wolf","partOf":"Wave of Terror in Europe"},{"date":"1","type":"Executed","dead":"300","injured":"0","location":"Tripoli, Libya","details":"Three-hundred West African migrants are reportedly rounded up by lslamic state and executed.[7]","perpetrator":"Islamic State","partOf":"Second Libyan Civil War"},{"date":"2","type":"Suicide bombing","dead":"3 (+1)","injured":"Unknown","location":"Mogadishu, Somalia","details":"A suicide bomber detonated himself in a popular restaurant near the National Theatre of Somalia in Mogadishu, killing at least three people. The attack was attributed to al-Qaeda-affiliated al-Shabaab.[8]","perpetrator":"al-Shabaab (suspected)","partOf":"War in Somalia"},{"date":"2","type":"Attack","dead":"8 (+6)","injured":"20","location":"Pathankot, India","details":"2016 Pathankot attack: suspected militants disguised as soldiers attacked an Indian air base killing seven security force members, including Subedar Fateh Singh who won gold and silver medals in the first Commonwealth Shooting Championships held in 1995, before being killed after a 15-hour gunfight. A civilian was also killed in the attack.[9]","perpetrator":"Jaish-e-Mohammed","partOf":"Insurgency in Jammu and Kashmir"},{"date":"3","type":"Suicide bombing","dead":"15 (+5 )","injured":"22","location":"Camp Speicher, Iraq","details":"Two of the bombers detonated their vehicle-borne explosives at the western gate of Camp Speicher, a former U.S. base outside the Sunni city of Tikrit. Three others exploded themselves after entering the section of the base where Iraqi police are being trained. The blasts killed at least 15 members of the security forces and wounded 22 others. The Islamic State claimed responsibility for the blasts and said it was aimed against Shi'ite Muslims.[10]","perpetrator":"Islamic State","partOf":"Iraqi Civil War"},{"date":"3","type":"Shooting","dead":"0","injured":"1","location":"Hakvasim Junction, West Bank","details":"Unknown gunman shot an Israeli soldier with a sniper rifle near Hakvasim Junction in South Hebron hills, on the southern tip of the West Bank, hitting his leg.[11]","perpetrator":"Palestinian lone wolf","partOf":"Israeli–Palestinian conflict"},{"date":"3","type":"Shooting","dead":"0","injured":"1","location":"Cave of the Patriarchs, Hebron, West Bank","details":"Unknown gunman shot an Israeli female soldier near the Cave of the Patriarchs, Hebron. The shots came from surrounding residential buildings.[11]","perpetrator":"Palestinian lone wolf","partOf":"Israeli–Palestinian conflict"},{"date":"4","type":"Suicide bombing","dead":"0 (+1)","injured":"30","location":"Kabul, Afghanistan","details":"Militant drove a truck packed with explosives to the armored gates of a compound for civilian contractors near Kabul's airport before being detonated, smashing windows and sending glass flying and badly damaging nearby houses. At least 30 Afghan civilians, including nine children, were wounded in the attack. Taliban claimed responsibility for the attack.[12]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"4","type":"Shooting","dead":"2","injured":"0","location":"Quetta, Pakistan","details":"Unknown militants have fatally shot two policemen in Quetta, the provincial capital of Balochistan, and fled the scene. No group claimed responsibility; however, Balochi nationalists are suspected.[13]","perpetrator":"Balochi nationalists (suspected)","partOf":"Balochistan conflict"},{"date":"5","type":"Shooting","dead":"1","injured":"0","location":"Samangan, Afghanistan","details":"A peace activist is gunned down by a suspected Taliban militant.","perpetrator":"Taliban (suspected)","partOf":"War in Afghanistan"},{"date":"6","type":"Raid","dead":"7","injured":"Unknown","location":"Izgeki, Borno, Nigeria","details":"Boko Haram gunmen raided Izageki village in northern Nigeria, close to Sambisa Forest, Boko Haram's hideout and killed at least two people. The gunmen pursued fleeing civilians and another militant armed with a suicide belt blew himself near a market, killing another five people.[14]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"7","type":"Car bombing","dead":"60","injured":"200","location":"Zliten Libya","details":"Zliten truck bombing: Suicide truck bomb was detonated at a police training camp al-Jahfal while around 400 young policemen were being trained in the Libyan town of Zliten, killing 60 people and wounding 200 others. No group claimed responsibility, but Islamic State is suspected.[15]","perpetrator":"Islamic State (suspected)","partOf":"Second Libyan Civil War"},{"date":"7","type":"Melee attack","dead":"0 (+1)","injured":"1","location":"Paris, France","details":"January 2016 Paris police station attack: An asylum seeker shouted \"Allahu Akbar!\"  outside a police station in Goutte d'Or, near Montmartre, where police shot and killed him while a by-passer was shot. Reports say he was wielding a knife and fake suicide vest.[16]","perpetrator":"Tarek Belgacem (Islamic State-inspired)","partOf":"Wave of Terror in Europe"},{"date":"7","type":"Car bomb","dead":"7","injured":"11","location":"Ra's Lanuf, Libya","details":"A car bombing at a checkpoint in the Libyan oil port of Ras Lanuf left seven people dead and 11 wounded. The car had been in a queue at the checkpoint and exploded when it reached the front.[17]","perpetrator":"Islamic State","partOf":"Second Libyan Civil War"},{"date":"7","type":"Shooting","dead":"0","injured":"1 (+1)","location":"Philadelphia, United States","details":"2016 shooting of Philadelphia police officer:On January 7, 2016, in West Philadelphia, in the late evening, a gunman shot Philadelphia police officer Jesse Hartnett, who was driving a marked police car. Hartnett survived, despite being shot multiple times in the left arm. He was able to get out of his car to shoot the fleeing suspect, Edward Archer. Later in the hospital, Archer claimed that he pledged allegiance to ISIL.[18]","perpetrator":"Islamist lone wolf","partOf":""},{"date":"8","type":"Shooting","dead":"4","injured":"0","location":"Ladha, Pakistan","details":"Unidentified militants shot four tribesmen, including a tribal elder Malik Wali Khan Mehsud, in Shaktoi area of Ladha in South Waziristan Agency of Federally Administered Tribal Areas (FATA). No group claimed responsibility, but Tehrik-i-Taliban Pakistan is suspected.[19]","perpetrator":"Tehrik-i-Taliban Pakistan (suspected)","partOf":"War in North-West Pakistan"},{"date":"8","type":"Melee attack","dead":"0 (+1)","injured":"3 (+1)","location":"Hurghada, Egypt","details":"2016 Hurghada attack: Two militants armed with a melee weapon and a signal flare, arrived by sea and stormed Bella Vista Hotel in the Red Sea city of Hurghada, stabbing three foreign tourists from Sweden and Austria. One of the assailants was shot dead and the other was wounded by security forces.[20] Islamic State claimed responsibility.[21]","perpetrator":"Islamic State","partOf":"Insurgency in Egypt"},{"date":"9","type":"Shooting","dead":"2","injured":"0","location":"Cairo, Egypt","details":"Unknown gunmen shot a traffic police district commander, and a conscript, who were driving to work in Cairo. No group claimed responsibility, but the Islamic State is suspected.[22]","perpetrator":"Islamic State (suspected)","partOf":"Insurgency in Egypt"},{"date":"9","type":"Landmine","dead":"2","injured":"3","location":"Koldan, Pakistan","details":"Militants planted a landmine which exploded on a Pakistani coastguard vehicle in a road between Koldan and Gwadar Port. Two coastguards were killed and another three were wounded. The Balochistan Liberation Army claimed responsibility for the attack.[23]","perpetrator":"Balochistan Liberation Army","partOf":"Balochistan conflict"},{"date":"9","type":"Shooting","dead":"2","injured":"0","location":"Quetta, Pakistan","details":"Unknown militants fatally shot two Policemen outside a mosque in Multani Mohala of Quetta, the provincial capital of Balochistan. The assailants managed to flee the scene.[24]","perpetrator":"Unknown","partOf":"Balochistan conflict"},{"date":"9","type":"Unarmed Assault","dead":"0","injured":"30","location":"Vancouver, Canada","details":"An assailant attacked Syrian refugees with pepper spray outside a welcome ceremony in Vancouver, British Columbia, Canada. At least 30 people were injured in the incident. No group claimed responsibility for the attack.[25]","perpetrator":"Lone wolf","partOf":"Terrorism in Canada"},{"date":"10","type":"Crushed","dead":"5","injured":"0","location":"Faisaliyah, Iraq","details":"Islamic State militants lined up five civilians and crushed them under a bulldozer for the crime of apostasy in the al-Faisaliyah area of Mosul, Iraq.[26]","perpetrator":"Islamic State","partOf":"Iraqi Civil War"},{"date":"11","type":"Melee attack","dead":"0","injured":"1","location":"Marseille, France","details":"A 15-year-old Turkish boy attempted to decapitate a teacher from a Jewish school in Marseille with a machete.[27][28]","perpetrator":"Turkish youth (Islamic State-inspired)","partOf":"Wave of Terror in Europe"},{"date":"11","type":"Attack","dead":"12+ (+6)","injured":"19","location":"Baghdad, Iraq","details":"January 2016 Iraq attacks: At least 12 people have been killed in an attack on the shopping centre al-Jawhara mall in Baghdad after a car bomb exploded outside. Hostages were taken by six gunmen in the incident. At least 19 people were injured.[29]","perpetrator":"Islamic State","partOf":"Iraqi Civil War"},{"date":"11","type":"Suicide bomber","dead":"20","injured":"Unknown","location":"Muqdadiyah, Iraq","details":"January 2016 Iraq attacks: A double blast at a cafe north of the Iraqi capital claimed another 20 lives in the late afternoon in the town of Muqdadiyah northeast of Baghdad. A suicide bomber detonated an explosives-rigged vehicle after people gathered at the scene. IS claimed the attack and named the suicide bomber as Abu Abdallah, an Iraqi. The security officers said that Shiites set alight several Sunni homes and a mosque following the attack.[30]","perpetrator":"Islamic State","partOf":"Iraqi Civil War"},{"date":"11","type":"Bombings","dead":"100+","injured":"Unknown","location":"Sharaban, Iraq","details":"January 2016 Iraq attacks: Two huge bomb blasts, one at a teashop and the other at a mosque, killed at least 100 people in the township of Sharaban in Iraq's northern Diyala province.","perpetrator":"Islamic State","partOf":"Iraqi Civil War"},{"date":"11","type":"Artillery","dead":"3","injured":"8","location":"Khost, Afghanistan","details":"Anti-government militants fired a rocket at a primary school in Bak District, Khost Province, killing three students and wound eight others. No group claimed responsibility.[31]","perpetrator":"Unknown","partOf":"War in Afghanistan"},{"date":"12","type":"Suicide bomber","dead":"13 (+1)","injured":"9","location":"Istanbul, Turkey","details":"2016 Istanbul bombing: A suicide bomber blew himself up near Hippodrome of Constantinople near the Sultan Ahmed Mosque in Istanbul, killing 13 people and wounding another 9, most of whom were foreign tourist. No group claimed responsibility, but Turkish authorities suspect the Islamic state.[32][33]","perpetrator":"Islamic State","partOf":"Turkey–ISIL conflict"},{"date":"12","type":"Shootout","dead":"1","injured":"0","location":"Aden, Yemen","details":"Unidentified assailants killed an officer of the security officer of the Aden's airport outside of his home by gunfire in Al-Mansoura district of Aden.[34]","perpetrator":"Unknown","partOf":"Yemeni Civil War"},{"date":"13","type":"Suicide bombing and attack","dead":"7 (+1)","injured":"7","location":"Jalalabad, Afghanistan","details":"A suicide bomber detonated its explosives near the Pakistani, Indian and Iranian consulates in Jalalabad killing two people. Then five policemen were killed by gunmen in an attack on the Pakistani Consulate.[35][36] ISIS Khorasan group claimed responsibility for the attack.","perpetrator":"Islamic State","partOf":"War in Afghanistan"},{"date":"13","type":"Suicide bombing","dead":"15 (+1)","injured":"25","location":"Quetta, Pakistan","details":"2016 Quetta suicide bombing: A Suicide bomber detonated himself near security personal vehicles close to a polio centre in a town near Quetta, killing at least 15 people, including 13 policemen and one soldier killed and wounding another 25, including 18 policemen, two soldiers and six civilians. Both Tehrik-i-Taliban Pakistan and Jaishul Islam organizations claimed responsibility.[37][38][39]","perpetrator":"Tehrik-i-Taliban Pakistan or Jaishul Islam","partOf":"War in North-West Pakistan"},{"date":"13","type":"Shooting","dead":"2","injured":"0","location":"Aden, Yemen","details":"Unidentified assailants arrived on motorcycles to Sheikh Othman roundabout in Aden and shot and killed two traffic policemen. Islamist extremists are suspected.[40]","perpetrator":"Islamist extremists suspected","partOf":"Yemeni Civil War"},{"date":"13","type":"Suicide bombing","dead":"12 (+1)","injured":"1","location":"Kouyape, Cameroon","details":"A suicide bomber blew himself inside a mosque at Kouyape, close to the Nigerian border. The blast killed twelve people and wounded another one. The attack occurred at dawn and was attributed to Boko Haram although it didn't officially claimed responsibility.[41]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"13","type":"Bombing, rocket, clashes","dead":"5 (+8)","injured":"36","location":"Diyarbakır Province, Turkey","details":"A massive bomb blast, followed by rocket and long gun fire, destroyed a police headquarters in the city of Cinar in the Diyarbakir Province. 5 people, including a baby, were killed and 36 were wounded. 8 terrorists were killed in clashes with police following the bombing. The militant Kurdish organization PKK has been blamed for the blast and accused of launching more attacks in the towns of Bismil, Cizre, Mardin, Silopi, Sirnak, and Van.[42]","perpetrator":"PKK","partOf":"Kurdish–Turkish conflict (2015–present)"},{"date":"13","type":"Landmine","dead":"0","injured":"2","location":"Bijapur, India","details":"Militants planted a landmine on a road near Basaguda Police Station. Two school students were injured after they hit the mines while driving motorcycles. No group claimed responsibility, but the Maoist Communist Party of India is suspected.[43]","perpetrator":"Communist Party of India (Maoist)","partOf":"Naxalite–Maoist insurgency"},{"date":"14","type":"Suicide bombings, shoot-out","dead":"4 (+4)","injured":"24","location":"Jakarta, Indonesia","details":"2016 Jakarta attacks: Several explosions followed by gunfire occurred in central Jakarta with a Starbucks and a police station appearing to be the main targets. The attack involved 7 participants and was directed by ISIL.[44]","perpetrator":"Islamic State","partOf":""},{"date":"14","type":"Bombing","dead":"2","injured":"1","location":"Aden, Yemen","details":"Unidentified militants planted an explosive device on a police car in Aden, killing two and wounding another. Islamists such as Islamic State or Al-Qaeda are suspected.[45]","perpetrator":"Islamists (suspected)","partOf":"Yemeni Civil War"},{"date":"14","type":"Bombing","dead":"2","injured":"5","location":"Baghdad, Iraq","details":"Unidentified militants planted an explosive device near a popular market in Taji are, north to Baghdad, killing two and wounding five. No group claimed responsibility.[46]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"14","type":"Shooting","dead":"6","injured":"Unknown","location":"Abu Gharib, Iraq","details":"Unidentified militants raided a house in the city of Abu Ghraib, west to Baghdad, killing at least six civilians, including five women and a man. No group claimed responsibility.[47]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"15","type":"Siege","dead":"63","injured":"Unknown","location":"Eel-Adde, Somalia","details":"El Adde attack: Massive siege at an African Union base.[48]","perpetrator":"al-Shabaab","partOf":"War in Somalia"},{"date":"15","type":"Assassination","dead":"1","injured":"0","location":"Koraput, India","details":"About 20 armed Maoists dragged a former Naib Sarpanch (deputy head of village level local self-government institution) identified as Krishna Miniaka to a nearby forest in Kandho Tikarapada village and there executed him. He was killed on the suspicion of being a ‘police informer’. CPI-Maoist claimed responsibility.[49]","perpetrator":"Communist Party of India (Maoist)","partOf":"Naxalite–Maoist insurgency"},{"date":"15","type":"Shooting","dead":"2","injured":"2","location":"Tin Abao, Burkina Faso","details":"Around 20 unidentified heavily armed militants attacked policemen in Tin Abao village, in Tin-Akof near the border with Mali, killing two and wounding two. No group claimed responsibility.[50]","perpetrator":"Unknown","partOf":"Insurgency in the Maghreb"},{"date":"15","type":"Shooting","dead":"2","injured":"0","location":"Baghdad, Iraq","details":"Unidentified militants opened fire on two civilians in the al-Fahama area in northern Baghdad, killing them both. No group claimed responsibility.[51]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"15-16","type":"Mass shooting, arson, siege","dead":"30 (+4)","injured":"56+","location":"Ouagadougou, Burkina Faso","details":"2016 Ouagadougou attack: Gunmen attacked with heavy weapons the restaurant Cappuccino and the Hotel Splendid at the heart of Ouagadougou, where more than 100 hostages were taken. 29 people were killed and more than 56 injured.[52][53] al-Qaeda in the Islamic Maghreb claimed responsibility for the attack.[54][55]","perpetrator":"al-Qaeda in the Islamic Maghreb","partOf":"Insurgency in the Maghreb"},{"date":"16","type":"Massacre","dead":"135-300+","injured":"Unknown","location":"Deir ez-Zor, Syria","details":"Deir ez-Zor offensive (January 2016): Islamic State militants attacked the neighbourhoods of Begayliya and Ayash in Deir ez-Zor, killing dozens of people in execution style murder. Fatality estimates variates between 135 and over 300. International sources reported that the attack was against Syrian Army personal and killed 85 Syrian soldiers along with 50 civilians while Syrian sources said over 300 people were killed, most of whom were children and women. The Islamic State organization claimed responsibility for the attack and claimed suicide bombers were used.[56][57][58]","perpetrator":"Islamic State","partOf":"Syrian Civil War"},{"date":"16","type":"Shooting","dead":"1","injured":"0","location":"Baquba, Iraq","details":"Unidentified gunmen shot a supermarket owner in front of his shop in al-Asri neighbourhood in Baqubah.[59]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"16","type":"Shooting","dead":"1","injured":"0","location":"Baghdad, Iraq","details":"Unidentified militants driving a motorcycle opened their fire at man in the city of al-Sadr in eastern Baghdad, resulting in his immediate death. No group claimed responsibility.[60]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"17","type":"Suicide bombing","dead":"14 (+1)","injured":"13","location":"Jalalabad, Afghanistan","details":"At least 14 people were killed when a suicide bomber struck during a Jirga at the home of politician Obaiduallah Shinwari, who escaped unscathed.[61]","perpetrator":"Unknown","partOf":"War in Afghanistan"},{"date":"17","type":"Suicide bombing","dead":"10","injured":"Unknown","location":"Aden, Yemen","details":"A suicide bomber detonated his explosives while within a car, on the entrance of the residence of Aden police chief, General Shalal Shaea. Shaea survived the attack while eight civilians and two guards were killed. No group claimed responsibility, but Al-Qaeda in the Arabian Peninsula is suspected.[62]","perpetrator":"Al-Qaeda in the Arabian Peninsula (suspected)","partOf":"Yemeni Civil War"},{"date":"17","type":"Bombing","dead":"2","injured":"9","location":"Baghdad, Iraq","details":"In south Baghdad bomb killed at least 2 people and another 9 were injured.[63]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"17","type":"","dead":"0","injured":"2","location":"Altenberg, Saxony, Germany","details":"A man attacks Afghan refugees with a steel helmet, two injured[64]","perpetrator":"","partOf":"Terrorism in Germany"},{"date":"17","type":"Attack","dead":"1","injured":"0","location":"Baghdad, Iraq","details":"In east of Baghdad a militant killed one civilian.[65]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"18","type":"Melee attack","dead":"0","injured":"1 (+1)","location":"Tekoa, West Bank","details":"A Palestinian lone wolf infiltrated into Tekoa, Gush Etzion and stabbed a pregnant woman in a second-hand clothes store in the Tekoa industrial area. He had fled the scene and was shot and neutralized by an armed civilian.[66]","perpetrator":"Palestinian lone wolf","partOf":"Israeli–Palestinian conflict"},{"date":"18","type":"Suicide bombing","dead":"4","injured":"2","location":"Nguetchewe, Cameroon","details":"A suicide bomber attacked a mosque in the village of Nguetchewe in northern Cameroon, killing four worshippers and wounding another two. No group claimed responsibility, but Boko Haram is suspected.[67]","perpetrator":"Boko Haram (suspected)","partOf":"Boko Haram insurgency"},{"date":"18","type":"Bombing","dead":"3","injured":"4","location":"Sirnak province, Turkey","details":"Three policeman were killed by an IED in the province of Sirnak while 4 other were injured. According to the authority, PKK was responsible.[68]","perpetrator":"PKK (suspected)","partOf":"Kurdish–Turkish conflict"},{"date":"18","type":"Bombing","dead":"1","injured":"8","location":"Baghdad, Iraq","details":"In west Baghdad a bomb killed one and another 8 were injured.[69]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"19","type":"Suicide bombing","dead":"10","injured":"42","location":"Peshawar, Pakistan","details":"A suicide bomber driving a motorcycle hit a roadside checkpoint on the N-5 National Highway, close to Peshawar killing ten people, including a child and injuring 42 others. Tehrik-i-Taliban Pakistan claimed responsibility.[70]","perpetrator":"Tehrik-i-Taliban Pakistan","partOf":"War in North-West Pakistan"},{"date":"19","type":"Bombing","dead":"6","injured":"1","location":"Quetta, Pakistan","details":"An IED was detonated in a FC's Margat Checkpoint in provincial capital Quetta, killing six Frontier Corps (FC) personnel and wounding another one. No group claimed responsibility for the attack.[71]","perpetrator":"Unknown","partOf":"Balochistan conflict"},{"date":"19","type":"Bombing","dead":"1","injured":"4","location":"Baghdad, Iraq","details":"In north Baghdad a bomb killed one policemen and another 4 were injured.[72]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"20","type":"Mass murder","dead":"20 (+4)","injured":"60","location":"Charsadda, Pakistan","details":"Bacha Khan University attack: Several gunmen, some equipped with suicide vests, opened fire on Bacha Khan University, killing 20 people and wounding another 20. At least four of the attackers were also killed during the attack. More than 200 students were rescued from the building. Tehrik-i-Taliban Pakistan claimed responsibility, and it was perpetrated by members of the Geedar-faction faction. However, the umbrella group, Taliban, denied and condemned the attack.[73]","perpetrator":"Tehrik-i-Taliban Pakistan","partOf":"War in North-West Pakistan"},{"date":"20","type":"Suicide bombing","dead":"7 (+1)","injured":"25","location":"Kabul, Afghanistan","details":"A suicide car bomber detonated his explosives close to the Russian embassy in Kabul, apparently targeting a minibus full of local journalists, owned by Moby Media Group's Kaboora company. The minibus was carrying the company's employees. Seven people were killed, including two women and around 25 were wounded. The Taliban, claimed responsibility.[74][75]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"20","type":"Shooting","dead":"1","injured":"0","location":"Tuz, Iraq","details":"Insurgents shoot dead a civilian in Tuz.[76]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"20","type":"Bombing","dead":"2","injured":"5","location":"Baghdad, Iraq","details":"In east of Baghdad a bomb exploded near a market. The blast killed at least 2 people and another 5 were injured.[77]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"21","type":"Shooting","dead":"5","injured":"3","location":"Arish, Egypt","details":"Unknown militants opened fire at policemen in Arish, killing five policemen and wounding another three. No group claimed responsibility.[78]","perpetrator":"Unknown","partOf":"Sinai insurgency"},{"date":"21","type":"Bombing","dead":"9","injured":"10","location":"Giza, Egypt","details":"Suspected Islamic militants detonated a bomb on a road leading to the Pyramids of Giza as policemen were arrived to a building where suspected militants were hiding. Ten people including six policemen were killed and another ten were wounded.[79] The Islamic State claimed responsibility.[80]","perpetrator":"Islamic State","partOf":"Insurgency in Egypt"},{"date":"21","type":"Bombing","dead":"1","injured":"1","location":"Baghdad, Iraq","details":"In southern Baghdad a bomb exploded a killed one civilian and another were injured.[81]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"21","type":"Shooting","dead":"1","injured":"0","location":"Baghdad, Iraq","details":"A militant killed one civilian in northern Baghdad.[82]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"21","type":"Bombing","dead":"3","injured":"7","location":"Baghdad, Iraq","details":"In north Baghdad a bomb killed at least 3 people and another 7 were injured.[83]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"22","type":"Mass murder","dead":"20 (+4)","injured":"17","location":"Mogadishu, Somalia","details":"2016 Mogadishu attack: al-Shabaab militants struck with a car bomb at the gate of a seafood restaurant overlooking a Mogadishu Lido Beach. Another blast struck about an hour later as government soldiers laid siege to the restaurant. After the blasts, militants entered the near crowded hotel, some of them by boat, and attacked civilians within. At least 20 people were killed and 17 were wounded. Four perpetrators were also killed and one was captured. Al-Qaeda linked Al-Shabaab claimed responsibility, saying the attackers used AK-47s and suicide vests.[84][85]","perpetrator":"al-Shabaab","partOf":"War in Somalia"},{"date":"23","type":"Beheading","dead":"1","injured":"0","location":"Bhal Syeda, Pakistan","details":"A Shiite is beheaded by radical Sunnis.","perpetrator":"Unknown","partOf":""},{"date":"24","type":"Bombing","dead":"1","injured":"6","location":"Baghdad, Iraq","details":"In southern Baghdad a bomb killed at least one and another six were injured, including 3 women.[86]","perpetrator":"","partOf":"Iraqi Civil War"},{"date":"25","type":"Suicide bombing","dead":"28 (+4)","injured":"65","location":"Bodo, Cameroon","details":"Four suspected Boko Haram suicide bombers attacked a busy market in the north Cameroonian town of Bodo, close to the Nigerian border. The blasts killed at least 28 people and wounded another 65. No group claimed responsibility, but Boko Haram is suspected.[87]","perpetrator":"Boko Haram (suspected)","partOf":"Boko Haram insurgency"},{"date":"25","type":"Suicide bombing","dead":"23","injured":"Unknown","location":"Aleppo, Syria","details":"A suicide bomber driving a fuel tank blew himself up at a checkpoint controlled by Syrian rebel group Ahrar ash-Sham in contested city of Aleppo. The blast killed 23 people including four of the group's commanders and four civilians. No group claimed responsibility.[88][89]","perpetrator":"Unknown","partOf":"Syrian Civil War"},{"date":"25","type":"Melee attack","dead":"1 (+2)","injured":"2","location":"Beit Horon, West Bank","details":"Two assailants attacked a woman outside of a grocery store in Beit Horon and wound another as she tried to flee the scene. A Security guard shot and killed the assailants. police suspected that the assailants also planted explosive devices at the scene.[90]","perpetrator":"Palestinians lone wolf","partOf":"Israeli–Palestinian conflict"},{"date":"25","type":"Bombing","dead":"2","injured":"1","location":"Xaisomboun Province, Laos","details":"Bomb attack killed 2 Chinese and injured another.[91]","perpetrator":"Unknown","partOf":""},{"date":"25","type":"Bombing","dead":"3","injured":"7","location":"Baghdad, Iraq","details":"A bomb killed 3 people and injured 7 other in eastern Baghdad.[92]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"25","type":"Bombing","dead":"2","injured":"7","location":"Baghdad, Iraq","details":"A bomb killed two people and another were wounded in south west Baghdad.[93]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"25","type":"Bombing","dead":"2","injured":"4","location":"Baghdad, Iraq","details":"A bomb killed two soldiers and 4 others were injured in southern Baghdad.[94]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"26","type":"Suicide bombing","dead":"24-29 (+2)","injured":"Unknown","location":"Homs, Syria","details":"Two suicide bombers arrived with vehicles to at an army checkpoint in Alawite Zara neighbourhood of Syrian government controlled Homs. One of the bombers blew himself while in the vehicle and as people were gathering the second bomber, wearing army uniform, blew himself on the crowd. State media said at least 24 people were killed and over 100 were wounded. Syrian Observatory said that 29 people were killed, including 15 members of pro-government factions. The Islamic State claimed responsibility for the attack.[95][96]","perpetrator":"Islamic State","partOf":"Syrian Civil War"},{"date":"26","type":"Poisoning, shooting","dead":"10","injured":"0","location":"Urozgan Province, Afghanistan","details":"An Afghan police officer tied to the Taliban drugged and killed 10 of his colleagues in Urozgan Province.[97]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"26","type":"Bombing","dead":"2","injured":"8","location":"Baghdad, Iraq","details":"At least 2 civilians were killed and another 8 were wounded after a bomb exploded in Taji District north of Baghdad.[98]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"26","type":"Bombing","dead":"1","injured":"3","location":"Baghdad, Iraq","details":"A bomb killed one policemen and another 3 were injured in Baghdad.[99]","perpetrator":"Unknown","partOf":"Iraqi Civil War"},{"date":"27","type":"Car bomb","dead":"55","injured":"Unknown","location":"Ramadi, Iraq","details":"2016 Ramadi attack: Up to a dozen car bombs were set off in the city of Ramadi attacking the tenth Iraqi army division. The attack killed 55 Iraqi soldiers and pro-government tribal fighters, wounding an unknown number as well. Islamic State claimed responsibility.[100]","perpetrator":"Islamic State","partOf":"Iraqi Civil War"},{"date":"27","type":"Clash","dead":"4","injured":"Unknown","location":"Diyarbakır Province, Turkey","details":"A clashes between soldier and PKK terrorist left 4 soldier dead in Diyarbakır Province, Sur district.[101]","perpetrator":"PKK","partOf":"Kurdish–Turkish conflict"},{"date":"28","type":"Suicide bombing","dead":"7","injured":"Unknown","location":"Aden, Yemen","details":"At least seven people are killed in a suicide bomb attack near the presidential palace in Aden, Yemen. The Islamic State claims it was behind the attack.[102]","perpetrator":"Islamic State","partOf":"Yemeni Civil War"},{"date":"29","type":"Bombing","dead":"2","injured":"5","location":"Arish, Sinai, Egypt","details":"Unknown militants detonated a car bomb near a school, targeting a police armoured vehicle, in Arish, killing two Egyptian policemen and wounding another five. No group claimed responsibility, but IS affiliated Wilayat Sayna is suspected.[103]","perpetrator":"Wilayat Sayna (suspected)","partOf":"Sinai Insurgency"},{"date":"29","type":"Suicide bombing","dead":"0 (+1)","injured":"7","location":"Zhob, Balochistan, Pakistan","details":"A suicide bomber, in a double cabin car, attempted to enter Cantt area in Zhob District when the Friday prayers were underway and blew himself at a check-post after security personnel signalled him to stop. Seven people were injured: six Pakistani soldiers and a child. Tehreek-e-Taliban Pakistan claimed responsibility.[104][105]","perpetrator":"Tehreek-e-Taliban Pakistan","partOf":"War in Northwest Pakistan"},{"date":"29","type":"Suicide bombing","dead":"4 (+2)","injured":"12","location":"Kerawa, Cameroon","details":"Two suicide bombers attacked a school, housing Nigerian refugees in northern Cameroon, killing four people and wounding another twelve. No group claimed responsibility, but Boko Haram is suspected.[106]","perpetrator":"Boko Haram (suspected)","partOf":"Boko Haram insurgency"},{"date":"29","type":"Suicide bombing","dead":"11","injured":"Unknown","location":"Gombi, Nigeria","details":"A 12-year-old blew himself up in the Gombis' market. The blast killed at least 11 people. The attack occurred on 29 January in Gombi, Nigeria.[107]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"29","type":"Suicide bombings, shoot-out","dead":"4 (+1)","injured":"18","location":"Al-Ahsa, Saudi Arabia","details":"Two assailants attacked the mosque of Imam Reza in the city of Al-Ahsa, at a time of great affluence for the weekly Friday prayers, causing it to explode one and the other opening fire on the faithful managed to disarm him and tie him up.[108]","perpetrator":"Islamic State","partOf":""},{"date":"29","type":"Suicide bombing","dead":"7 (+1)","injured":"8","location":"Aden, Yemen","details":"A suicide car bomber struck a checkpoint in the southern Yemen city of Aden, killing seven and wounding another eight. Islamic State affiliate in Yemen claimed responsibility for the attack.[109]","perpetrator":"Islamic State","partOf":"Yemeni Civil War"},{"date":"30","type":"Melee attack","dead":"0","injured":"1","location":"Jerusalem, Israel","details":"An American-Israeli was stabbed received and minor injuries. The terrorist then went to the police.[110]","perpetrator":"Palestinian lone wolf","partOf":"Israeli–Palestinian conflict"},{"date":"30","type":"Bombing","dead":"86","injured":"Unknown","location":"Dalori, Nigeria","details":"2016 Dalori attack: At least 86 people are killed and hundreds others injured in an attack by Boko Haram militants on Dalori Village some 4 kilometers from Maiduguri, Nigeria[111][112]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"31","type":"Shooting","dead":"0 (+1)","injured":"3","location":"Beit El, West Bank","details":"Palestinian hidden in a car fired at an Israeli patrol.[113]","perpetrator":"Palestinian lone wolf","partOf":"Israeli–Palestinian conflict"},{"date":"31","type":"Bombing","dead":"60+","injured":"110","location":"Damascus, Syria","details":"2016 Sayyidah Zaynab bombings: At least 60 people were killed and 110 wounded in twin blasts in the mainly Shi'ite neighbourhood of Sayeda Zeinab.[114]","perpetrator":"Islamic State","partOf":"Syrian Civil War"},{"date":"31","type":"Suicide bombing","dead":"1 (+1)","injured":"32","location":"Guié, Chad","details":"Boko Haram terrorist blew himself up on a motorcycle 1 dead, 32 injured.[115]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"31","type":"Suicide bombing","dead":"2 (+1)","injured":"24","location":"Miterine, Chad","details":"Boko Haram terrorist blew himself up 2 dead, 24 injured.[115]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"31","type":"Bombing","dead":"2","injured":"4","location":"Rafah, Sinai, Egypt","details":"Unknown militants detonated an explosive device on a police vehicle as security forces were carrying out a search operation in the Rafah region, on the border with the Gaza Strip, killing two policemen and wounding another four. No group claimed responsibility, but Islamic State affiliated Wilayat Sayna is suspected.[116][117]","perpetrator":"Wilayat Sayna (suspected)","partOf":"Sinai Insurgency"},{"date":"31","type":"Bombing","dead":"2","injured":"0","location":"Sheikh Zuweid, Sinai, Egypt","details":"Unknown militants detonated an explosive device on a vehicle carrying an army officer and a conscript, killing them both. No group claimed responsibility but Islamic State affiliated Wilayat Sayna is suspected.[116][117]","perpetrator":"Wilayat Sayna (suspected)","partOf":"Sinai Insurgency"}]