[{"date":"1","type":"Attack","dead":"21","injured":"9","location":"North Sinai, Egypt","details":"July Sinai attacks: Militants from the IS-affiliated Wilayat Sayna organization simultaneously attacked 21 Egyptian security positions in North Sinai in attempt to establish territorial control over those territories. Militants detonated two suicide car bombs in Sheikh Zuweid targeting two military barriers and then besieged a police station in Sheikh Zuweid and clashed with Egyptian forces in Sheikh Zuweid and Rafah. Militants also attacked and shelled minor security positions across North Sinai and claimed it had detonated a suicide car bomb in Arish but no media or official reports confirmed that.[1] The attacks left 21 Egpytians dead and 9 wounded.","perpetrator":"Wilayat Sayna\n(Islamic State)\n","partOf":"Sinai Insurgency"},{"date":"1–2","type":"Massacre","dead":"145","injured":"17","location":"Kukawa, Nigeria","details":"Kukawa, Nigeria Massacre: Boko Haram militants attacked multiple mosques between July 1 and 2. 84 men and boys were killed on the 1st at one mosque in Kukawa. 17  were wounded in the attack. 97 others, mostly men, were killed in numerous mosques on the 2nd with a number of women and young girls killed in their homes. An unknown number were wounded. Boko Haram claimed responsibility.[2]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"2","type":"Assassination","dead":"1","injured":"0","location":"Miahuatlán de Porfirio Díaz, Mexico","details":"Two assailants attacked a journalist departing a radio station building in Miahuatlan de Porfirio Diaz city, Oaxaca state, Mexico. The journalist, Filadelfo Sanchez Sarmiento, was killed in the attack. No group claimed responsibility for the incident.[3]","perpetrator":"Unknown","partOf":"Mexican Drug War"},{"date":"4","type":"Car bombing","dead":"10","injured":"Unknown","location":"Derna, Libya","details":"Three car bombs killed ten civilians in the city of Derna, Libya. An unknown number were wounded. Bombings occurred during clashes between Islamic State and Al-Qaeda militants. Responsibility for the bombings is unknown.[4]","perpetrator":"Unknown","partOf":"Libyan Civil War"},{"date":"4","type":"Bombing","dead":"7","injured":"9","location":"Waziristan, Pakistan","details":"Three separate attacks in Pir Ghr, North Waziristan and South Waziristan claimed the lives of seven soldiers and injured nine others. Tehrik-i-Taliban Pakistan claimed responsibility for the attack.[5]","perpetrator":"Tehrik-i-Taliban Pakistan","partOf":"War in North-West Pakistan"},{"date":"5","type":"Bombing","dead":"69","injured":"67+","location":"Jos and Potiskum, Nigeria","details":"Boko Haram set off bombs at a mosque and restaurant in Jos. Fifty-one were killed along with 67 injured. In Potiskum, militants killed six in a suicide bombing. Later militants killed nine people and burned thirty-two churches and three hundred houses in cities in the Northeast. Boko Haram claimed responsibility for the attacks.[6]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"4–5","type":"Raid","dead":"26","injured":"","location":"Lake Chad, Chad","details":"Boko Haram raided two villages on Lake Chad (Merom and Tiskra) on 4 and 5 July and killed 13 people in each attack. The militants slit the throats of their victims and burned down houses, before fleeing.[7]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"7","type":"Suicide bombing","dead":"25","injured":"32","location":"Zaria, Nigeria","details":"A suspected suicide bomber blow himself up outside of a government building in the city of Zaria. Twenty-five were killed and thirty-two injured in the bombing. Boko Haram claimed responsibility for the attacks.[8]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"7","type":"Mass shooting","dead":"14","injured":"0","location":"Mandera, Kenya","details":"Fourteen quarry workers were ambushed and killed in the city of Mandera. Christians were targeted in the attack, killing ten, letting Muslims escape. No wounded were reported during the attack. Al Shabaab militants claimed responsibility, mirroring previous attacks.[9]","perpetrator":"Al Shabaab","partOf":"Somali Civil War"},{"date":"8","type":"Beheading","dead":"3","injured":"","location":"Faryab Province, Afghanistan","details":"Three policemen who were abducted by Taliban a few days previously were found beheaded on 8 July on the Qaisar-Ghormach highway in Faryab Province of Afghanistan.[10]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"9","type":"Execution","dead":"5","injured":"","location":"Bosso, Niger","details":"Boko Haram militants slit the throats of five civilians in Dagaya, a village near Bosso, Niger.[11]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"10","type":"Raid","dead":"11","injured":"","location":"Ngamdu, Nigeria","details":"Boko Haram militants raided the village of Ngamdu, Nigeria and killed 11 people.[12]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"10","type":"Raid","dead":"43","injured":"","location":"Monguno, Nigeria","details":"Boko Haram militants raided three villages in Monguno (Kalwa, Misala and Gwollam) and killed 43 people by either slitting their throats or gunshots. After the killings, the militants burned down houses in the villages.[13]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"11","type":"Bombing","dead":"4","injured":"1","location":"Maiduguri, Nigeria","details":"A tricycle exploded near the office of the department of state security in Maiduguri, killing four passengers and injuring an onlooker.[14]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"11","type":"Suicide bombing","dead":"15","injured":"80","location":"N'Djamena, Chad","details":"A man disguised as a woman in a full-face veil killed 15 people and injured 80 in a suicide bombing in N'Djamena, Chad.[12]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"11","type":"Car bomb","dead":"1","injured":"9","location":"Cairo, Egypt","details":"A car bombing outside the Italian consulate in Cairo killed one person, wounded nine others and resulted in widespread damage and flooding. Islamic State claimed responsibility for the attack.[15] See Bombing of the Cairo Italian Consulate","perpetrator":"Islamic State","partOf":"Sinai Insurgency"},{"date":"12","type":"Car bomb, suicide bombing","dead":"29","injured":"81","location":"Baghdad, Iraq","details":"A series of bombs across Baghdad on 12 July killed at least 29 people and wounded 81 others.[16] Islamic State claimed responsibility for the attacks.","perpetrator":"Islamic State","partOf":"Iraq War"},{"date":"12","type":"Raid","dead":"4","injured":"","location":"Diffa, Niger","details":"Boko Haram militants raided a prison in Diffa and killed a prison guard, before three of the militants were killed.[17]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"13","type":"Suicide bombing","dead":"33","injured":"10","location":"Khost Province","details":"Suicide bombing killed at least 33 people and another 10 were injured in Khost Province.[18]","perpetrator":"Unknown","partOf":"War in Afghanistan"},{"date":"13","type":"Suicide bombing","dead":"13","injured":"10","location":"Fotokol, Cameroon","details":"At least 12 people die in suicide attacks in a town of Fotokol.[19]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency in Cameroon"},{"date":"15","type":"Attack","dead":"33","injured":"unknown","location":"Borno State, Nigeria","details":"Boko Haram killed at least 33 people in three separate attacks in the northeast part of the country.[20]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"15","type":"Melee attack","dead":"0","injured":"1","location":"Nahliel, West Bank","details":"Twenty-two-year-old Ruan Abu Matar approached a military post near the Israeli Settlement of Nahliel in the West Bank and stabbed a soldier leaving him in a light-to-moderate condition.[21]","perpetrator":"Ruan Abu Matar(lone wolf)","partOf":"Israeli–Palestinian conflict"},{"date":"16","type":"Car bombing","dead":"1","injured":"2","location":"Riyadh, Saudi Arabia","details":"At least 1 person died and another 2 were wounded in car bombing in Riyadh.[22]","perpetrator":"Islamic State","partOf":"Terrorism in Saudi Arabia"},{"date":"16","type":"Ambush","dead":"2","injured":"0","location":"Narathiwat Province, Thailand","details":"Gunmen killed 2 soldiers in Thailand.[23]","perpetrator":"Unknown","partOf":"South Thailand insurgency"},{"date":"16","type":"Spree shooting","dead":"5  (+1) ","injured":"2","location":"Chattanooga, United States","details":"2015 Chattanooga shootings: 24-year-old Kuwaiti-born American Muhammad Abdulazeez opened fire on a U.S. military recruitment center and a U.S. Navy Reserve center in Chattanooga, Tennessee, killing 4 U.S. Marines and a sailor, and wounding a Marine and a Chattanooga police officer. An investigation revealed Abdulazeez had been radicalized online by foreign Islamic terror group.","perpetrator":"Muhammad Abdulazeez (lone wolf)","partOf":""},{"date":"17","type":"Suicide bombing","dead":"64","injured":"0","location":"Damaturu, Nigeria","details":"Suicide bombers killed at least 64 people in multiple blasts in the northeastern towns of Gombe and Damaturu, Nigeria. (WSJ via AP)(Local 10) (BBC)","perpetrator":"Unknown","partOf":"Boko Haram insurgency"},{"date":"17","type":"Suicide bombing, car bomb","dead":"130","injured":"130","location":"Khan Bani Saad, Iraq","details":"Khan Bani Saad bombing: A car bomb was sent to a crowded market in Khan Bani Saad in Iraq, 30 km north to Baghdad, during the Eid al-Fitr celebrations. The explosion killed at least 100 (15 children among them) and injuring another 170 people and brought down several buildings. Islamic State claimed responsibility and said 180 people were killed.[24][25][26]","perpetrator":"Islamic State","partOf":"Iraqi Civil War"},{"date":"20","type":"Suicide bombing","dead":"34","injured":"104","location":"Suruc, Turkey","details":"Suruç bombing: A suicide bomber attacked a Peoples' Democratic Party protest in Suruc, Turkey. Thirty-two were killed along with an unknown number of wounded. Islamic State was suspected to be behind the bombing.[27]","perpetrator":"Islamic State","partOf":"Turkey–ISIL conflict"},{"date":"22","type":"Bombing","dead":"0","injured":"3","location":"Saravena, Colombia","details":"At least thre soldiers were wounded when militants of the Domingo Lains front threw grenades and improvised explosives to a military post in Saravena, Arauca.[28]","perpetrator":"ELN","partOf":"Colombian conflict"},{"date":"25","type":"Suicide bombing","dead":"12","injured":"45","location":"Tuz Khurmatu, Iraq","details":"Two suicide bombers attacked a crowded swimming pool in Tuz Khurmatu, Iraq, causing at least 12 deaths and injuries to 45 others.[29]","perpetrator":"Unknown","partOf":"Iraq War"},{"date":"26","type":"Suicide bombing","dead":"16","injured":"50","location":"Damaturu, Nigeria","details":"A girl aged about 10 detonated a suicide bomb near a crowded market in Damaturu, Nigeria, killing at least 16 and injuring 50 others.[30]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"26","type":"Suicide bombing","dead":"10–15","injured":"unknown","location":"Mogadishu, Somalia","details":"Jazeera Palace Hotel suicide bombing: A suicide bomber detonates a vehicle loaded with explosives at a hotel in the Somali capital of Mogadishu, killing 10–15 people and wounding several others.","perpetrator":"Al-Shabaab","partOf":"Somali Civil War"},{"date":"26","type":"Suicide bombing","dead":"20","injured":"70","location":"Maroua, Cameroon","details":"A 13-year-old female suicide bomber attacks in the Cameroonian town of Maroua, killing 20 people and injuring another 70.","perpetrator":"Unknown","partOf":"Boko Haram insurgency in Cameroon"},{"date":"26","type":"Shooting","dead":"1","injured":"0","location":"Istanbul, Turkey","details":"One policeman was shot and killed in the Gazi neighborhood, by members of DHKP/C.[31]","perpetrator":"DHKP/C","partOf":"DHKP/C insurgency in Turkey"},{"date":"27","type":"Mass shooting","dead":"10","injured":"16","location":"Punjab, India","details":"2015 Gurdaspur attack: Gunmen dressed in Indian Army uniforms opened fire on a civilian bus and then took over a police station in the northern state of Punjab early on Monday, killing at least five people, the police said, in a region that has been mostly calm since India quelled a Sikh insurgency there two decades ago.[32]","perpetrator":"Unknown","partOf":""},{"date":"28","type":"Bombing","dead":"2","injured":"6","location":"Sitra, Bahrain","details":"Two policemen were killed and six others injured in a bombing in the village of Sitra in Bahrain.[33]","perpetrator":"Unknown","partOf":"Terrorism in Bahrain"},{"date":"29","type":"Suicide bombing, car bomb","dead":"12+","injured":"8","location":"Ramadi, Iraq","details":"A Humvee packed with explosives was rammed into Iraqi forces deployed outside of the University of Ramadi and detonated[34]","perpetrator":"Islamic State (suspected)","partOf":"Iraq War"},{"date":"29","type":"Suicide bombing, car bomb","dead":"6","injured":"4","location":"Fallujah, Iraq","details":"A Humvee packed with explosives was driven at paramilitary forces near Fallujah and detonated.[35]","perpetrator":"Islamic State (suspected)","partOf":"Iraq War"},{"date":"30","type":"Suicide bombing, car bomb","dead":"9","injured":"16","location":"Baghdadi, Iraq","details":"A suicide bomber in an explosive laden truck detonated at a military base outside the town of Baghdadi.[36]","perpetrator":"Islamic State","partOf":"Iraq War"},{"date":"30","type":"Suicide bombing, car bomb","dead":"5","injured":"8","location":"Fallujah, Iraq","details":"A suicide bomber rammed his explosive-packed truck into an outpost near al-Mazraa military camp during clashes with Islamic State in Iraq.[36]","perpetrator":"Islamic State","partOf":"Iraq War"},{"date":"30","type":"Arson, Vandalism","dead":"0","injured":"0","location":"Santiago, Chile","details":"According to the Carabineros report, \"two individuals threw a hammer and a stone that struck the wall by breaking three windows\".In a statement they were responsible for the attack where it justified the sale of beach land to hotel chains on the coast of Chile[37]","perpetrator":"Movimiento Juvenil Lautaro","partOf":"Terrorism in Chile"},{"date":"31","type":"Arson","dead":"3","injured":"1","location":"Duma, West Bank","details":"Duma arson attack: Two masked men arrived at two houses in Duma and threw two Molotov cocktails into the houses. One of the houses was empty; in the other, the Daobasa family slept and the explosive burned the house, killing 18-months-old Ali Saad and severely wounding his parents and his 4-year-old brother.[38] The father of the family succumbed to his wounds on 8 August.[39]","perpetrator":"Jewish gang","partOf":"Israeli–Palestinian conflict"},{"date":"31","type":"Suicide bombing","dead":"8–10","injured":"11","location":"Maiduguri, Nigeria","details":"A suicide bomber detonated a tricycle in a crowded market in north-eastern Nigeria. Initially reported as a female suicide bomber by witnesses, experts later identified the attacker as male.[40][41]","perpetrator":"Boko Haram(suspected)","partOf":"Boko Haram insurgency"},{"date":"31","type":"Suicide bombing, car bomb","dead":"9","injured":"Unknown","location":"Qoton, Yemen","details":"A car packed with explosives was detonated at a checkpoint near the city of Qoton in southeastern Yemen.[42][43]","perpetrator":"Al-Qaeda in the Arabian Peninsula  (Suspected)","partOf":"Yemeni Civil War"},{"date":"31","type":"Melee attack","dead":"1","injured":"5","location":"Jerusalem, Israel","details":"Thirty-nine-year-old Yishai Schlissel, an ultra-Orthodox Jew, stabbed six people in a Jerusalem gay pride parade. Among them was 16-year-old Shira Banki, who died from her wounds two days later. Shlissel had been recently released from prison after serving a ten-year sentence for stabbing three people in a similar gay pride parade in 2005.[44]","perpetrator":"Yishai Schlissel(lone wolf)","partOf":"Israeli–Palestinian conflict"}]