[{"date":"1","type":"Shooting","dead":"6","injured":"3","location":"N'guigmi Department, Niger","details":"Six soldiers were killed and three others injured in an attack by Boko Haram jihadists on a military position in Bla Brin, a village not far from the Lake Chad area, in the N'guigmi department of the Diffa region in southeastern Niger.[1][2]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"1","type":"Shooting, Arson","dead":"+1","injured":"Unknown","location":"Buea and Mbengwi, Cameroon","details":"Separatists invaded the Muea neighborhood of Buea. The separatists battled intervening government troops, set up roadblocks and unsuccessfully tried to burn down a police station. In Mbengwi, a Cameroonian soldier was killed in an ambush and separatists stormed a gendarmerie post, catching the few gendarmes present off-guard. After hours of shootouts, the attackers overwhelmed the defenders, burned down the post and escaped before Cameroonian reinforcements could arrive.[3][4]","perpetrator":"Ambazonia Defence Forces","partOf":"Anglophone Crisis"},{"date":"1","type":"Suicide car bombing","dead":"1 (+1)","injured":"22","location":"Kirkuk, Iraq","details":"One person was killed and 22 others injured when a suicide bomber detonated his explosives laden vehicle near a ballot box warehouse in the Iraqi city of Kirkuk.[5][6]","perpetrator":"Islamic State","partOf":"Iraqi insurgency"},{"date":"1","type":"Bombing","dead":"6","injured":"1","location":"Talataye, Mali","details":"A vehicle carrying several MSA fighters hit an explosive device, probably a mine, in the centre of the village of Talataye in the Ansongo Cercle of the Malian Gao region. Six fighters were killed and another injured in the incident.[7][8]","perpetrator":"Islamic State (suspected)","partOf":"Northern Mali conflict"},{"date":"1","type":"Shooting","dead":"6","injured":"0","location":"Barkin Ladi, Nigeria","details":"Six civilians were killed and 16 houses were burned when Fulani herdsmen attack the village of Sabon Angwa in Barkinladi Local government Council of Plateau State. [9]","perpetrator":"Fulani herdsmen","partOf":"Communal conflicts in Nigeria"},{"date":"1","type":"Suicide car bombing","dead":"4 (+1)","injured":"31","location":"Gao, Mali","details":"A suicide bomber drove a vehicle loaded with explosives into an army patrol and detonated it in the Malian city of Gao. Four civilians were killed and 31 others, including four French soldiers, wounded in the attack.[10][11]","perpetrator":"Al-Qaeda in the Islamic Maghreb","partOf":"Northern Mali conflict"},{"date":"1","type":"Shooting","dead":"0 (+4)","injured":"2","location":"Datu Saudi-Ampatuan, Philippines","details":"Two soldiers were wounded in a shootout with terrorists in the municipality of Datu Saudi-Ampatuan in the Philippine province of Maguindanao. Four BIFF militants were killed in the gunfight.[12]","perpetrator":"Bangsamoro Islamic Freedom Fighters","partOf":"Moro conflict"},{"date":"1","type":"Mortar attack","dead":"5","injured":"10","location":"Mogadishu, Somalia","details":"At least five civilians were killed and ten others injured after Al-Shabaab militants fired mortars in residential areas of the Somali capital Mogadishu.[13]","perpetrator":"Al-Shabaab","partOf":"Somali Civil War"},{"date":"1","type":"Suicide bombing","dead":"20 (+1)","injured":"20","location":"Jalalabad, Afghanistan","details":"July 2018 Jalalabad suicide bombing: A suicide bomber detonated his explosives in the center of the eastern Afghan city of Jalalabad, killing at least 20 people, including several members of the small Sikh minority, and injuring 20 others.[14][15]","perpetrator":"Islamic State","partOf":"War in Afghanistan"},{"date":"2","type":"Bombing","dead":"0","injured":"1","location":"Krong Pinang District, Thailand","details":"A 60-year-old man lost his foot after stepping on an explosive device at a rubber plantation in the Krong Pinang district of Yala province in Thailand.[16][17]","perpetrator":"Barisan Revolusi Nasional","partOf":"South Thailand insurgency"},{"date":"2","type":"Grenade attack","dead":"0","injured":"0","location":"Pulwama district, India","details":"Militants fired a grenade at an army camp in the village of Bounra in the Pulwama district of the Indian state of Jammu and Kashmir. No one was killed or injured in the incident.[18]","perpetrator":"Jaish-e-Mohammed","partOf":"Insurgency in Jammu and Kashmir"},{"date":"2","type":"Arson","dead":"0","injured":"0","location":"Carahue, Chile","details":"Two forest machines were destroyed in the San Alberto farm in the commune of Carahue, in the Araucanía region. In the next day the Coordinadora Arauco Malleco claimed responsibility for his attack and others perpetrated in June.[19][20]","perpetrator":"Coordinadora Arauco Malleco","partOf":"Mapuche conflict"},{"date":"2","type":"Ambush","dead":"6","injured":"2","location":"Mashkai Tehsil, Pakistan","details":"Suspected insurgents ambushed and killed six paramilitary soldiers and other two were injured in the Mashkai Tehsil in the district of Awaran in the southern Pakistani province of Balochistan.[21][22]","perpetrator":"Baluch Liberation Front","partOf":"Insurgency in Balochistan"},{"date":"2","type":"Shooting","dead":"2","injured":"2","location":"North Waziristan, Pakistan","details":"Two personnel of the Khasadar force were killed and another and a government official injured after their vehicle was attacked by terrorists in North Waziristan in northwest Pakistan.[23][24]","perpetrator":"Tehrik-i-Taliban Pakistan (suspected)","partOf":"War in North-West Pakistan"},{"date":"2","type":"Shooting","dead":"1","injured":"1","location":"Shariff Saydona Mustapha, Philippines","details":"A soldier was killed in a firefight with the Bangsamoro Islamic Freedom Fighters in the municipality of Shariff Saydona Mustapha in Maguindanao in the Philippines. His companion was also wounded.[25]","perpetrator":"Bangsamoro Islamic Freedom Fighters","partOf":"Moro conflict"},{"date":"2","type":"Bombing","dead":"1","injured":"7","location":"Mogadishu, Somalia","details":"At least one person was killed and seven others injured when a roadside bomb exploded in the Somali capital Mogadishu.[26]","perpetrator":"Al-Shabaab (suspected)","partOf":"Somali Civil War"},{"date":"2","type":"Suicide car bombing","dead":"2 (+1)","injured":"3","location":"Pol-e Alam, Afghanistan","details":"At least one woman and a child were killed and three other women injured in a suicide car bombing targeting a foreign convoy in Pol-e Alam, the provincial capital of the Afghan province of Logar.[27]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"3","type":"Bombing","dead":"3","injured":"6","location":"Dera Bugti District, Pakistan","details":"A bomb detonated by remote control killed three workers doing a survey for a local oil exploration company near the town of Dera Bugti in the Pakistani province of Balochistan. Six others were injured in the incident.[28][29]","perpetrator":"Baloch Republican Army","partOf":"Insurgency in Balochistan"},{"date":"3","type":"Shooting","dead":"6","injured":"4","location":"Surobi District, Afghanistan","details":"Six police personnel were killed and four others injured in a firefight with Taliban militants in the Surobi district of the Afghan province of Kabul.[30]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"3","type":"Assassination","dead":"2","injured":"0","location":"Tumaco, Colombia","details":"The bodies of two Ecuadorian civilians were found in Tumaco, Colombia. The bodies belonged to a couple kidnapped by FARC dissidents[31]","perpetrator":"FARC dissidents","partOf":"Colombian conflict"},{"date":"3","type":"Ambush","dead":"0","injured":"7","location":"Ijara, Kenya","details":"Seven police officers were injured in an ambush by Al-Shabaab militants between Sangailu and Handaro in the sub-county of Ijara in the county of Garissa in Kenya.[32]","perpetrator":"Al-Shabaab","partOf":"Spillover of the war in Somalia"},{"date":"3","type":"Shooting","dead":"1","injured":"3","location":"Arauca Department, Colombia","details":"A policeman was shoot dead for suspected ELN militants in the city of Arauca. Later the attackers were captured after a gunfight that left two cops wounded. In the municipality of Saravena militants attacked the police station that left one police injured. In Fortul It has been attacked on two occasions in less than 24 hours, a situation that has not left casualties.[33][34]","perpetrator":"ELN","partOf":"Colombian conflict"},{"date":"3","type":"Bombing","dead":"2","injured":"0","location":"Al-Mansoura, Yemen","details":"Two Security Belt militiaman were killed when an improvised explosive device detonated in Mansoura district in the city of Aden in Yemen's Aden governorate.[35]","perpetrator":"Houthis (suspected)","partOf":"Yemeni Civil War (2015–present)"},{"date":"3","type":"Shooting","dead":"0","injured":"3","location":"Datu Paglas, Philippines","details":"Three military personnel were wounded in a firefight with Bangsamoro Islamic Freedom Fighters rebels in Datu Paglas in the Philippine province of Maguindanao.[25][36]","perpetrator":"Bangsamoro Islamic Freedom Fighters","partOf":"Moro conflict"},{"date":"3","type":"Bombing","dead":"1","injured":"7","location":"Hodan District, Somalia","details":"At least one civilian was killed and seven others injured when a roadside landmine went off in Mogadishu's Hodan district.[37]","perpetrator":"Al-Shabaab","partOf":"War in Somalia"},{"date":"4","type":"Bombing","dead":"0","injured":"1","location":"Bannang Sata District, Thailand","details":"A Buddhist rubber tapper was injured when a homemade bomb exploded at his rubber plantation in the Bannang Sata district of Yala province in Thailand.[16][38]","perpetrator":"Barisan Revolusi Nasional","partOf":"South Thailand insurgency"},{"date":"4","type":"Shooting","dead":"3","injured":"2","location":"Burka District, Afghanistan","details":"A group of armed militants attacked a house in the Burka district of the northern Afghan province of Baghlan and opened fire, killing three government employees and injuring two others.[39]","perpetrator":"Taliban (suspected)","partOf":"War in Afghanistan"},{"date":"4","type":"Bombing","dead":"0","injured":"8","location":"Buenaventura, Colombia","details":"Eight soldiers, two of them seriously, were injured in a bomb attack carried out by members of the ELN in the rural area of the seaport city Buenaventura in Colombia.[40]","perpetrator":"ELN","partOf":"Colombian conflict"},{"date":"4","type":"Shooting","dead":"1 (+1)","injured":"0","location":"Mamasapano, Philippines","details":"An army lieutenant and a senior commander of the Bangsamoro Islamic Freedom Fighters were killed in a gunfight in Mamasapano in the Philippine province of Maguindanao.[41]","perpetrator":"Bangsamoro Islamic Freedom Fighters","partOf":"Moro conflict"},{"date":"4","type":"Shooting","dead":"1","injured":"0","location":"Juba, South Sudan","details":"Unknown gunmen attacked a humanitarian convoy in Juba, South Sudan killing the driver the gunmen then fled afterwards.[42]","perpetrator":"Sudan People's Liberation Army (suspected)","partOf":"South Sudanese Civil War"},{"date":"4","type":"Bombings","dead":"1","injured":"11","location":"Baghdad, Iraq","details":"One person was killed and 11 others wounded when two bombs exploded at a market in a Shia-majority neighborhood in Iraq's capital Baghdad.[43]","perpetrator":"Islamic State (suspected)","partOf":"Iraqi insurgency"},{"date":"5","type":"Bombing","dead":"0","injured":"1","location":"Yupo, Thailand","details":"A rubber tapper was seriously injured in a bomb explosion in the tambon of Yupo in the Mueang Yala district of the Thai province of Yala.[44][45]","perpetrator":"Barisan Revolusi Nasional","partOf":"South Thailand insurgency"},{"date":"5","type":"Rocket attack","dead":"0","injured":"2","location":"Asadabad, Afghanistan","details":"A rocket fired by insurgents wounded two people, including a police officer, in Asadabad, the capital of the eastern Afghan province of Kunar.[46]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"5","type":"Shooting","dead":"5","injured":"0","location":"Guyuk, Nigeria","details":"Five civilians were killed and several houses were burned by armed Fulani herdsmen in the locality of Kola, Guyuk, Adamawa State.[47][48]","perpetrator":"Fulani herdsmen","partOf":"Communal conflicts in Nigeria"},{"date":"5","type":"Shooting","dead":"2","injured":"5","location":"Keana Nigeria","details":"Two soldiers were killed and five others were injured including a commander, in Keana Local Government Area of Nasarawa State. The attack is in response of multiple military operations against the herdsmen in the area.[49]","perpetrator":"Fulani herdsmen","partOf":"Communal conflicts in Nigeria"},{"date":"5","type":"Bombing","dead":"0 (+3)","injured":"4","location":"Khogyani District, Afghanistan","details":"Three Taliban militants, including one commander, were killed and four civilians injured in a bomb blast in the Khogyani district of the eastern Afghan province of Nangarhar.[50][51]","perpetrator":"Islamic State","partOf":"War in Afghanistan"},{"date":"5","type":"Kidnapping, shooting","dead":"1","injured":"0","location":"Shopian district, India","details":"A police constable was abducted from his home in the village of Vehil in the Shopian district of the Indian state of Jammu and Kashmir. His dead body was found later.[52][53]","perpetrator":"Hizbul Mujahideen","partOf":"Insurgency in Jammu and Kashmir"},{"date":"5","type":"Bombings","dead":"0","injured":"1","location":"Bangil, Indonesia","details":"Three bombs exploded in a house in the village of Pogar in Bangil in the Pasuruan district of East Java province, wounding a child.[54][55]","perpetrator":"Islamic State","partOf":"Terrorism in Indonesia"},{"date":"5","type":"Shooting","dead":"4","injured":"0","location":"Badush, Iraq","details":"A father and his three children were killed by members of the Islamic State in a village in Badush in the Iraqi Nineveh governorate.[56]","perpetrator":"Islamic State","partOf":"Iraqi insurgency"},{"date":"5","type":"Bombing","dead":"1","injured":"22","location":"Manbij, Syria","details":"At least one person was killed and 22 others were injured when a bomb exploded at an anti-Turkey demonstration in the northern Syrian city of Manbij.[57][58]","perpetrator":"Syrian National Army (suspected)","partOf":"Syrian Civil War"},{"date":"5","type":"Kidnapping, shooting","dead":"7","injured":"0","location":"Diyala Governorate, Iraq","details":"Islamic state militants shoot dead seven members of one family on their way back from a wedding ceremony in the eastern Iraqi province of Diyala after kidnapping them.[59][60]","perpetrator":"Islamic State","partOf":"Iraqi insurgency"},{"date":"6","type":"Bombings","dead":"3","injured":"7","location":"Gelan District, Afghanistan","details":"Three children were killed and seven others injured when two roadside mines exploded in residential areas in the Gelan district of the southern Afghan province of Ghazni.[61]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"6","type":"Grenade attack, shooting","dead":"0","injured":"1","location":"Pulwama district, India","details":"Militants threw a grenade at a military camp in a village in Jammu and Kashmir's Pulwama district in India, causing no damage. In another incident, terrorists fired at an imam in the village of Parigam in the Pulwama district of the Indian state of Jammu and Kashmir. The victim received several bullet wounds.[62][63][64]","perpetrator":"Jaish-e-Mohammed and Hizbul Mujahideen (suspected)","partOf":"Insurgency in Jammu and Kashmir"},{"date":"6","type":"Shooting","dead":"0 (+3)","injured":"1","location":"Dantewada district, India","details":"A gunfight between Naxals and District Reserve Guard personnel left a balance of three militants killed and a jawan injured.[65]","perpetrator":"CPI","partOf":"Naxalite–Maoist insurgency"},{"date":"6","type":"Grenade attack","dead":"0","injured":"0","location":"Srinagar, India","details":"Terrorists threw a grenade at a Central Reserve Police Force party in the city of Srinagar in Jammu and Kashmir in India. No one was killed or injured in the incident.[66][67]","perpetrator":"Jaish-e-Mohammed","partOf":"Insurgency in Jammu and Kashmir"},{"date":"6","type":"Car bombing","dead":"18","injured":"Unknown","location":"Al-Busayrah, Syria","details":"A car bomb went off in front of the Syrian Democratic Forces' base in the town of Al-Busayrah in the Syrian governorate of Deir Ezzor, killing a commander, ten other personnel and seven civilians, including three children.[68][69]","perpetrator":"Islamic State","partOf":"Syrian Civil War"},{"date":"6","type":"Shooting, execution, arson","dead":"5","injured":"1","location":"Macomia District, Mozambique","details":"A car with six occupants, which left Quiterajo in the Macomia district, was stopped by a group of men in possession of firearms and machetes. The armed men opened fire and burned down the vehicle. All six civilians fled, but only one was found alive and wounded. A decapitated head was also found at the scene.[70]","perpetrator":"Ansar al-Sunna (suspected)","partOf":"Islamist insurgency in Mozambique"},{"date":"7","type":"Shooting","dead":"1","injured":"0","location":"Bamenda, Cameroon","details":"A gendarme officer was shot dead along the Bamenda-Ndop road, leaving his body by the side of the road.[71]","perpetrator":"Ambazonia Defence Forces","partOf":"Anglophone crisis"},{"date":"7","type":"Bombing","dead":"1","injured":"3","location":"Barawa District, Somalia","details":"A former commissioner of the Qoriyoley district was killed, while three others were injured in a roadside bomb attack near the town of Barawa in the Lower Shabelle region of Somalia.[72]","perpetrator":"Al-Shabaab","partOf":"Somali Civil War"},{"date":"7","type":"Car bombings, shooting","dead":"20 (+3)","injured":"24","location":"Mogadishu, Somalia","details":"July 2018 Mogadishu bombings: At least 20 people were killed and two dozen others wounded when fighters of the Somali group Al-Shabaab attacked the compound of Somalia's interior and security ministries in the center of Mogadishu. The attack started when the terrorists detonated two car bombs outside the main gate of the interior ministry building before three militants stormed it. All three gunmen were killed by the security forces.[73][74][75]","perpetrator":"Al-Shabaab","partOf":"Somali Civil War"},{"date":"7","type":"Bombing","dead":"1","injured":"0","location":"Charsadda District, Afghanistan","details":"A district chief was killed in a roadside bomb blast in the Charsadda district in the Afghan province of Ghor.[76]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"7","type":"Ambush","dead":"4 (+6)","injured":"6 (+7)","location":"Waghaz District, Afghanistan","details":"Four police officers, including a commander, were killed and six others wounded in an ambush by Taliban militants in the Waghaz district of the southeastern Afghan province of Ghazni. Six Taliban fighters were also killed and at least seven others sustained injuries after the Afghan forces responded to the attack.[77]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"7","type":"Grenade attack","dead":"0","injured":"2","location":"Srinagar, India","details":"Terrorists attacked a Central Reserve Police Force patrol party with a grenade on the outskirts of Srinagar in the Indian state of Jammu and Kashmir, injuring a soldier and a civilian.[78]","perpetrator":"Jaish-e-Mohammed (suspected)","partOf":"Insurgency in Jammu and Kashmir"},{"date":"7","type":"Bombing","dead":"3","injured":"0","location":"Hawija District, Iraq","details":"Three farmers were killed in a bomb explosion in the Hawija district of the Iraqi province of Kirkuk.[79]","perpetrator":"Islamic State (suspected)","partOf":"Iraqi insurgency"},{"date":"7","type":"Shooting","dead":"1","injured":"2","location":"Diyala Governorate, Iraq","details":"A security man guarding an oil pipeline, 50 km west of the Iraqi city of Baqubah, was killed and two others were injured in an attack by a group of Islamic state militants.[80][81]","perpetrator":"Islamic State","partOf":"Iraqi insurgency"},{"date":"7","type":"Shooting, kidnapping","dead":"1","injured":"4","location":"Al-Shirqat District, Iraq","details":"Islamic state militants attacked a village near the town of Al-Shirqat, some 280 km north of the Iraqi capital Baghdad, killing one villager, kidnapping another and wounding three others.[82]","perpetrator":"Islamic State","partOf":"Iraqi insurgency"},{"date":"7","type":"Shooting, kidnapping","dead":"2","injured":"2","location":"Tazirbu, Libya","details":"Suspected Islamist militants shot dead an engineer and a guard and kidnapped two others at a water plant in Tazirbu in southeastern Libya.[83]","perpetrator":"Islamic State (suspected)","partOf":"Libyan Civil War"},{"date":"7","type":"Bombing","dead":"0","injured":"8","location":"Bannu, Pakistan","details":"Eight people, including a Muttahida Majlis-e-Amal candidate for the Khyber Pakhtunkhwa Assembly constituency PK-89, were injured in a roadside bomb blast in Bannu in northern Pakistan.[84]","perpetrator":"Tehrik-i-Taliban Pakistan (suspected)","partOf":"War in North-West Pakistan"},{"date":"7","type":"Execution, arson","dead":"4","injured":"1","location":"Palma District, Mozambique","details":"At least four people were killed and beheaded and a fifth seriously injured in an attack by the terrorist group Ansar al-Sunna in the village of Macanga in the Palma district of the northern Mozambican province of Cabo Delgado. In addition, the attackers set five houses on fire in the village.[85]","perpetrator":"Ansar al-Sunna","partOf":"Islamist insurgency in Mozambique"},{"date":"8","type":"Rocket attack","dead":"0","injured":"10","location":"Ghazni, Afghanistan","details":"Taliban militants fired rockets at government buildings in the capital of the Afghan province of Ghazni, injuring two soldiers and eight civilians.[86]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"8","type":"Execution","dead":"4","injured":"0","location":"Mocímboa da Praia District, Mozambique","details":"Four people were beheaded by terrorists in an attack in the village of Mbau in the district of Mocímboa da Praia in the northern Mozambican province of Cabo Delgado.[87]","perpetrator":"Ansar al-Sunna","partOf":"Islamist insurgency in Mozambique"},{"date":"8","type":"Ambush","dead":"6","injured":"3","location":"Aïn Soltane, Tunisia","details":"Six members of the Tunisian security forces were killed and another three injured in an ambush in the area of Aïn Soltane in the Tunisian governorate of Jendouba near the border with Algeria.[88][89]","perpetrator":"Al-Qaeda in the Islamic Maghreb","partOf":"Insurgency in the Maghreb"},{"date":"8","type":"Shooting","dead":"2 (+2)","injured":"0 (+1)","location":"Buraidah, Saudi Arabia","details":"A member of the Saudi Arabian security forces and a foreign citizen were killed when three armed men opened fire from a car at a checkpoint in Buraidah in the Saudi Arabian region of Al-Qassim. Two of the attackers were also killed and another injured in the ensuing gunfight.[90][91]","perpetrator":"Islamic State","partOf":"Terrorism in Saudi Arabia"},{"date":"8","type":"Bombing","dead":"3","injured":"14","location":"Qabasin, Syria","details":"A motorcycle bomb exploded in the town of Qabasin in the Syrian governorate of Aleppo, killing three people and injuring 14 others.[92][93]","perpetrator":"Unknown","partOf":"Syrian Civil War"},{"date":"9","type":"Bombing","dead":"0","injured":"9","location":"Chaparhar District, Afghanistan","details":"At least nine civilians, including two children, were injured in a bomb explosion in the Chaparhar district of the eastern Afghan province of Nangarhar.[94]","perpetrator":"Islamic State (suspected)","partOf":"War in Afghanistan"},{"date":"9","type":"Bombing","dead":"1 (+1)","injured":"0","location":"Khogyani District, Afghanistan","details":"A Taliban insurgent and a civilian were killed in the Khogyani district of the Afghan province of Nangarhar.[95][96]","perpetrator":"Islamic State (suspected)","partOf":"War in Afghanistan"},{"date":"9","type":"Bombing","dead":"1","injured":"3","location":"Kamjong district, India","details":"An Assam Rifle trooper was killed and two other personnel injured when an improvised explosive device detonated in the village of Kangpat in the Kamjong district of Manipur state, India.[97]","perpetrator":"People's Liberation Army of Manipur","partOf":"Insurgency in Manipur"},{"date":"9","type":"Bombing","dead":"2","injured":"0","location":"Pakhanjore, India","details":"Two members of the Border Security Force were killed in a bomb blast triggered by Maioists in a village, about seven kilometers north of Marbeda, in the Pak tehsil of Kanker district in the Indian state of Chhattisgarh.[98]","perpetrator":"CPI","partOf":"Naxalite–Maoist insurgency"},{"date":"9","type":"Grenade attacks","dead":"0","injured":"0","location":"Tral, India","details":"Militants carried out two grenade attacks on CRPF camps in Jammu and Kashmir's town of Tral in India. No casualty or damage was caused.[99]","perpetrator":"Jaish-e-Mohammed (suspected)","partOf":"Insurgency in Jammu and Kashmir"},{"date":"9","type":"Shooting","dead":"3 (+4)","injured":"5","location":"Baiji, Iraq","details":"Islamic State militants killed three government-backed militia fighters and injured five others near Iraq's largest oil refinery in the city of Baiji. Four attackers were also killed and at least two others were still at large.[100]","perpetrator":"Islamic State","partOf":"Iraqi insurgency"},{"date":"9","type":"Shootings","dead":"3","injured":"0","location":"Mogadishu, Somalia","details":"Three people, including a former Somali electoral delegate, were shot dead in separate attacks in Somalia's capital Mogadishu.[101][102]","perpetrator":"Al-Shabaab and Islamic State","partOf":"Somali Civil War"},{"date":"9","type":"Shooting","dead":"0","injured":"1","location":"Bosaso, Somalia","details":"Islamic state fighters shot and seriously injured a senior security officer in the Somali city of Bosaso.[103]","perpetrator":"Islamic State","partOf":"Somali Civil War"},{"date":"9","type":"Shootings, shelling","dead":"27 (+6)","injured":"40","location":"Latakia District, Syria","details":"At least 27 regime forces, including eight officers, were killed in clashes and shelling in a village in the Latakia district of the Syrian governorate of Latakia. Another 40 government loyalists were wounded and six terrorists killed.[104][105]","perpetrator":"Ansar al-Islam and Fursan al-Iman","partOf":"Syrian Civil War"},{"date":"10","type":"Arson","dead":"0","injured":"0","location":"Padre Las Casas, Chile","details":"A group of mapuche militants burned an evagelican church in the municipality Budimallín, Padre Las Casas, Chile. In the site of the attack were found canvases related with the mapuche cause.[106][107]","perpetrator":"Weichan Auka Mapu (suspected)","partOf":"Mapuche conflict"},{"date":"10","type":"Shooting","dead":"4","injured":"3","location":"Khogyani District (Ghazni), Afghanistan","details":"Sayed Munir, the district police chief of Khogyani district in the Afghan province of Ghazni, and three other policemen were killed in a gunfight with the Taliban. In addition, three other police officers were injured.[108]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"10","type":"Shooting, Standoff","dead":"2 (+13)","injured":"14","location":"Shariff Saydona Mustapha, Maguindanao, Philippines","details":"A series of clashes were reported in the municipality of Shariff Saydona Mustapha, Maguindanao. The clashes they concluded with the death of a rebel commander in the area, the military said.[109][110]","perpetrator":"Bangsamoro Islamic Freedom Fighters","partOf":"Moro conflict"},{"date":"10","type":"Suicide bombing","dead":"12 (+1)","injured":"5","location":"Jalalabad, Afghanistan","details":"A suicide bomber detonated his explosives near a petrol pump, killing two officials working for Afghanistan's intelligence agency and ten civilians, including children, and sparking a big fire that burned eight cars in the eastern Afghan city of Jalalabad. Five other people were taken to hospital.[111]","perpetrator":"Islamic State","partOf":"War in Afghanistan"},{"date":"10","type":"Shooting, kidnapping","dead":"0","injured":"5","location":"Liboi, Kenya","details":"Al-Shabaab militants attacked a police post in Liboi in the county of Garissa in Kenya, injuring four police officers. Another policeman was missing and possibly kidnapped by the attackers.[112][113]","perpetrator":"Al-Shabaab","partOf":"Spillover of the war in Somalia"},{"date":"10","type":"Suicide car bombing","dead":"14 (+1)","injured":"Unknown","location":"Zayzun, Syria","details":"At least 14 regime and opposition fighters were killed in a suicide car bomb attack targeting a military position in Zayzun, a town in the western countryside of the Syrian governorate of Daraa.[114]","perpetrator":"Islamic State","partOf":"Syrian Civil War"},{"date":"10","type":"Shooting","dead":"1","injured":"0","location":"Cho-airong District, Thailand","details":"A soldier working with a development unit was gunned down by insurgents on a road in the Cho-airong district of Narathiwat province in Thailand.[115]","perpetrator":"Barisan Revolusi Nasional (suspected)","partOf":"South Thailand insurgency"},{"date":"10","type":"Suicide bombing","dead":"22 (+1)","injured":"75","location":"Peshawar, Pakistan","details":"2018 Peshawar suicide bombing: A suicide bombing at an election rally in the northwestern Pakistani city of Peshawar killed at least 22 people, including prominent local politician Haroon Bilour. The attack at a campaign event organised by the Awami National Party also injured at least 75 people.[116][117][118]","perpetrator":"Tehrik-i-Taliban Pakistan","partOf":"War in North-West Pakistan"},{"date":"10","type":"Shooting, arson","dead":"2","injured":"2","location":"Palma District, Mozambique","details":"A group of more than 20 men with firearms attacked the village of Quisingule in the Palma district in the northern Mozambican province of Cabo Delgado, killing two people, injuring two officials and stealing arms. The attackers also burned down some houses in the village.[119]","perpetrator":"Ansar al-Sunna (suspected)","partOf":"Islamist insurgency in Mozambique"},{"date":"10","type":"Shooting","dead":"5","injured":"0","location":"Girei, Nigeria","details":"A militant group claiming to be Boko Haram killed five civilians and hoisted its flag in Luru in the local government area of Girei in the Nigerian state of Adamawa.[120]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"11","type":"Shooting","dead":"1","injured":"0","location":"Ghatshila, India","details":"One CRPF member were killed during a gunfight between Naxals and CRPF in Ghatshila, East Singhbhum district, Jarkhand.[121]","perpetrator":"CPI","partOf":"Naxalite–Maoist insurgency"},{"date":"11","type":"Bombing","dead":"5","injured":"4","location":"Khaki Safed District, Afghanistan","details":"At least five civilians were killed and four others injured in a roadside bomb attack in Khaki Safed district in the western Afghan province of Farah.[122]","perpetrator":"Taliban (suspected)","partOf":"War in Afghanistan"},{"date":"11","type":"Suicide bombing, shooting","dead":"12 (+3)","injured":"9","location":"Jalalabad, Afghanistan","details":"At least 12 people were killed and another nine injured in a militant attack on the building of the provincial education department in the eastern Afghan city of Jalalabad. One suicide bomber detonated his explosives, while two more were shot dead by the security forces in a gunfight lasting several hours.[123][124][125]","perpetrator":"Islamic State (suspected)","partOf":"War in Afghanistan"},{"date":"11","type":"Shootings, shelling","dead":"40","injured":"10","location":"Archi District and Khwaja Ghar District, Afghanistan","details":"A series of simultaneous attacks by the Taliban killed at least 40 Afghan soldiers and injured ten others in the Archi district in the province of Kunduz and in the Khwaja Ghar district in the province of Takhar in Afghanistan.[126][127][128][129]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"11","type":"Shooting, arson","dead":"3","injured":"0","location":"Tumaco, Colombia","details":"Three members of the Technical Investigation Corps traveling in a car were killed by FARC dissidents in the municipality of Tumaco in the Colombian department of Nariño. The vehicle was also set on fire by the attackers.[130][131]","perpetrator":"FARC dissidents","partOf":"Colombian conflict"},{"date":"11","type":"Shooting","dead":"0","injured":"0","location":"San Andrés de Cuerquia, Colombia","details":"A bus carrying workers from the Ituango Dam was attacked by FARC dissidents in San Andrés de Cuerquia in the Colombian department of Antioquia. No casualties were reported.[132][133]","perpetrator":"FARC dissidents","partOf":"Colombian conflict"},{"date":"11","type":"Shooting","dead":"1","injured":"1","location":"Kupwara district, India","details":"An Indian Army commando was killed and another injured in a gunfight with militants in a forested area of Jammu and Kashmir's Kupwara district in India.[134]","perpetrator":"Jaish-e-Mohammed (suspected)","partOf":"Insurgency in Jammu and Kashmir"},{"date":"12","type":"Shooting","dead":"1","injured":"0","location":"Plaridel, Philippines","details":"A man was shot dead by a gunman in the municipality of Plaridel in the Philippine province of Quezon.[135]","perpetrator":"New People's Army","partOf":"CPP–NPA–NDF rebellion"},{"date":"12","type":"Bombing, Attempted Bombing","dead":"0","injured":"0","location":"Datu Paglas, Philippines","details":"An improvised explosive device detonate in the center town of Datu Paglas, no casualties were reported in the scene.Just a week after four militants  were killed in a gunfight in a bangaray a kilometer away. Later an improvised bomb planted along a roadside here triggered traffic along the Cotabato-Isulan highway Army bomb experts defused the IED.[136][137]","perpetrator":"Bangsamoro Islamic Freedom Fighters","partOf":"Moro conflict"},{"date":"12","type":"Shooting","dead":"1","injured":"0","location":"Bagudo, Nigeria","details":"A police command was shot dead for Fulani herdsmen Kaoje Police Division in Bagudo local government area.[138]","perpetrator":"Fulani herdsmen","partOf":"Communal conflicts in Nigeria"},{"date":"12","type":"Bombings, shooting","dead":"0","injured":"0","location":"Mandera County, Kenya","details":"Al-Shabaab fighters hurled explosives into a camp and then fired on officers in the county of Mandera in Kenya. No one was injured in the incident.[139]","perpetrator":"Al-Shabaab","partOf":"Spillover of the war in Somalia"},{"date":"13","type":"Shooting, Assassination Attempted","dead":"0  (+10)","injured":"5","location":"Southwest Region, Cameroon","details":"Separatists carried out an unsuccessful assassination attempt on Defense Minister Joseph Beti Assomo, who was visiting the Anglophone region with a delegation. In the evening, his convoy was ambushed by separatists using guns and poisoned spears. The Cameroonian Army claimed to have killed 10 separatists in the ensuing 30-minute battle. Four soldiers and a journalist were injured, but the Defense Minister escaped unharmed. The separatists had previously warned Assomo from visiting Ambazonia.[140]","perpetrator":"Ambazonia Defence Forces","partOf":"Anglophone crisis"},{"date":"13","type":"Shooting","dead":"2","injured":"2","location":"Achabal, India","details":"Two Central Reserve Police Force personnel were killed and a soldier and a civilian injured after militants attacked a force party in Achabal in Jammu and Kashmir's Anantnag district in India.[141]","perpetrator":"Lashkar-e-Taiba","partOf":"Insurgency in Jammu and Kashmir"},{"date":"13","type":"Bombing","dead":"0","injured":"1","location":"Belfast, Northern Ireland","details":"The house of Gerry Adams in west Belfast was attacked with a home-made bomb. Adams survived injury and claimed that his two grandchildren were standing at the doorway only ten minutes before the blast at 10:50 pm. The house of another republican in Belfast, Bobby Storey, was also attacked the same day. The attack occurred during the current unrest in Derry.[142][143]","perpetrator":"New IRA","partOf":"Dissident Irish Republican campaign"},{"date":"13","type":"Ambush","dead":"10","injured":"2","location":"Bama, Nigeria","details":"Boko Haram terrorists ambushed a detachment of troops in the local government area of Bama in the Nigerian state of Borno. Ten corpses of soldiers were found and at least one officer and one soldier were injured.[144][145][146]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"13","type":"Shooting, Grenade Attack","dead":"0","injured":"0","location":"Derry, Northerin Ireland","details":"The New IRA claimed responsibility for gun and bomb attacks at police during the disturbances in Derry.[147][148][149]","perpetrator":"New IRA","partOf":"Dissident Irish Republican campaign"},{"date":"13","type":"Bombing","dead":"5","injured":"37","location":"Bannu, Pakistan","details":"2018 Mastung and Bannu bombings: At least five people were killed and 37 others injured when explosives fitted to a motorbike detonated at an election rally in Bannu in the Pakistani province of Khyber Pakhtunkhwa.[150][151]","perpetrator":"Ittehad-ul-Mujahideen","partOf":"War in North-West Pakistan"},{"date":"13","type":"Suicide bombing","dead":"149 (+1)","injured":"186","location":"Mastung, Pakistan","details":"2018 Mastung and Bannu bombings: At least 149 people, including the Balochistan Awami Party candidate Nawabzada Siraj Raisani, were killed and 186 others injured when a suicide bomber detonated his explosives in Mastung in the Pakistani province of Balochistan.[152][153]","perpetrator":"Islamic State","partOf":"War in North-West Pakistan"},{"date":"13","type":"Grenade attack","dead":"3","injured":"4","location":"Baidoa, Somalia","details":"At least three soldiers were killed and four others injured when a grenade was thrown into a house in the Somali city of Baidoa.[154]","perpetrator":"Al-Shabaab","partOf":"Somali Civil War"},{"date":"14","type":"Rocket attack","dead":"0","injured":"4","location":"Sderot, Israel","details":"Four members of a family were slightly wounded when a rocket hit their home.[155]","perpetrator":"Izz ad-Din al-Qassam (suspected)","partOf":"Israeli–Palestinian conflict"},{"date":"14","type":"Suicide car bombing, car bombing, shooting","dead":"5 (+5)","injured":"Several","location":"Mogadishu, Somalia","details":"At least ten people were killed, including five of the attackers, in two assaults near the presidential palace in Mogadishu. First, a speeding car exploded at a security checkpoint, followed by heavy gunfire between the terrorists and security forces. A second car bomb exploded nearby. Several others were also injured in the attacks.[156][157]","perpetrator":"Al-Shabaab","partOf":"Somali Civil War"},{"date":"14","type":"Suicide car bombing","dead":"1 (+1)","injured":"11","location":"Lashkargah, Afghanistan","details":"A suicide bomber detonated a vehicle full of explosives in the city of Lashkargah in the Afghan province of Helmand, killing at least one policeman and injuring 11 others.[158]","perpetrator":"Taliban (suspected)","partOf":"War in Afghanistan"},{"date":"14","type":"Shooting, stabbing","dead":"0 (+3)","injured":"2","location":"Sleman Regency, Indonesia","details":"Islamic militants attacked anti-terror officers with sharp weapons and a firearm in the Sleman regency in the special region of Yogyakarta in Indonesia. The personnel of the elite unit then shot dead three attackers, but two of the officers suffered arm wounds.[159][160]","perpetrator":"Islamic State","partOf":"Terrorism in Indonesia"},{"date":"14","type":"Shooting","dead":"62","injured":"50","location":"Geidam, Nigeria","details":"Islamist militants loyal to Abu Musab al-Barnawi, the leader of a Boko Haram faction, overran the base in the village of Jilli in the local government of Geidam in the Nigerian Yobe state. 62 soldiers were killed and at least 50 others injured in the attack.[161][162]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"14","type":"Kidnapping, shooting","dead":"1","injured":"1","location":"Pakhanjore, India","details":"Two villagers were kidnapped by Naxalites in Rengawahi in the Pakhanjore tehsil district of Kanker district in the Indian state of Chhattisgarh. The bullet-ridden body of one of the abductees was later found and the other is still in the captivity of the terrorists.[163]","perpetrator":"CPI","partOf":"Naxalite–Maoist insurgency"},{"date":"14","type":"Arson","dead":"0","injured":"0","location":"Buenaventura, Colombia","details":"Militants beloging to the National Liberation Army blocked a road and burned a truck tractor and other was painted with the initials of the guerrilla group in the municipality of Buenaventura, Valle del Cauca Department. No casualties were reported.[164]","perpetrator":"ELN","partOf":"Colombian conflict"},{"date":"15","type":"Suicide bombing","dead":"8 (+1)","injured":"17","location":"Kabul, Afghanistan","details":"A suicide bomber blew himself up near a government ministry in Kabul, killing at least eight people and wounding 17 others.[165][166]","perpetrator":"Islamic State","partOf":"War in Afghanistan"},{"date":"15","type":"Shooting, kidnapping, execution","dead":"3","injured":"1","location":"Gadchiroli district and Pakhanjore, India","details":"Two members of the Border Security Force were killed and another injured in a gunfight with Naxalites near Mahla in the Pakhanjore tehsil in Chhattisgarh's Kanker district in India. In another incident, a civilian was abducted from his village in the Gadchiroli district of the Indian state of Maharashtra and later killed by terrorists in the same tehsil as in the first assault.[167][168]","perpetrator":"CPI","partOf":"Naxalite–Maoist insurgency"},{"date":"15","type":"Shooting, arson","dead":"14","injured":"0","location":"Ménaka Region, Mali","details":"Suspected jihadists shot dead 14 civilians in an attack on the village of Injagalane in the northeastern Malian region of Ménaka. The attackers also burned one truck and three other vehicles.[169][170]","perpetrator":"Islamic State (suspected)","partOf":"Northern Mali conflict"},{"date":"15","type":"Shooting","dead":"2","injured":"1","location":"Kolofata, Cameroon","details":"Two villagers were killed and a third injured in an attack by Boko Haram terrorists in the village of Goudoumboul in the commune of Kolofata in the Mayo-Sava department in northern Cameroon.[171]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"16","type":"Arson","dead":"0","injured":"0","location":"Vilcún, Chile","details":"At least three wineries and six agricultural machines were completely destroyed when Mapuche militants burned the place. In the site of the attack were found canvases allusive to the Mapuche cause and the Weichan Auka Mapu claimed responsibility for the attack reported Carabineros. The attack left an economic loss of 600 million Chilean pesos.[172][173][174]","perpetrator":"Weichan Auka Mapu","partOf":"Mapuche conflict"},{"date":"16","type":"Shooting","dead":"7","injured":"0","location":"Shinwar District, Afghanistan","details":"Seven police officers were killed in a Taliban attack in the Shinwar district of Nangarhar province in Afghanistan.[175]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"16","type":"Shooting","dead":"2","injured":"0","location":"Kanker district, India","details":"Two villagers who were kidnapped were found dead in a forest of Baande area, Kanker district, Chhattisgarh. The villagers were killed for being blamed to be police informer.[176]","perpetrator":"CPI","partOf":"Naxalite–Maoist insurgency"},{"date":"16","type":"Shooting","dead":"0 (+1)","injured":"2","location":"Kupwara district, India","details":"A suspected militant was killed and two soldiers were injured in a gunfight near the Line of Control in Jammu and Kashmir's Kupwara district in India.[177]","perpetrator":"Lashkar-e-Taiba (suspected)","partOf":"Insurgency in Jammu and Kashmir"},{"date":"16","type":"Shooting","dead":"3","injured":"2","location":"Besao, Philippines","details":"A gunfight between Philippine soldiers and NPA guerrillas left three soldiers killed and two others in the bangaray of Tamboan, Besao, Mountain Province[178]","perpetrator":"New People's Army","partOf":"Communist rebellion in the Philippines"},{"date":"16","type":"Shooting","dead":"1","injured":"1","location":"Pulwama district, India","details":"A police officer was killed and another injured after militants opened fire at a police post guarding the home of a National Conference leader in Jammu and Kashmir's Pulwama district in India.[179]","perpetrator":"Hizbul Mujahideen","partOf":"Insurgency in Jammu and Kashmir"},{"date":"16","type":"Grenade attack","dead":"0","injured":"10","location":"Cucuta, Colombia","details":"At least eight sex workers and two employeeswere injured during an attack to a dating house in the city of Cucuta, Norte de Santander Department.[180][181]","perpetrator":"Autodefensas Gaitanistas de Colombia","partOf":"Colombian conflict"},{"date":"17","type":"Bombing","dead":"2","injured":"0","location":"Mir Ali, Pakistan","details":"Two soldiers were killed in a jeep when a bomb planted at the road went off. The remote-controlled bomb detonated at Zarmuk Road, North Waziristan's Mir Ali.[182]","perpetrator":"Tehrik-i-Taliban Pakistan (suspected)","partOf":"Insurgency in Balochistan"},{"date":"17","type":"Suicide bombing","dead":"27 (+1)","injured":"23","location":"Sayyad District, Afghanistan","details":"27, including several Taliban militants, were killed and 23 others wounded in a suicide bombing that targeted a funeral for a deceased person in the Sayyad district of the northern Afghan province of Sar-e Pol.[183][184]","perpetrator":"Islamic State","partOf":"War in Afghanistan"},{"date":"17","type":"Shooting","dead":"1 (+1)","injured":"+1","location":"Bamenda, Cameroon","details":"Separatists invaded Bamenda to enforce a \"ghost town\", and a Cameroonian counterattack left a separatist and a Cameroonian soldier dead.[185]","perpetrator":"Ambazonia Defence Forces","partOf":"Anglophone crisis"},{"date":"17","type":"Grenade attack","dead":"0","injured":"0","location":"Pulwama district, India","details":"Militants hurled a grenade at a Central Reserve Police Force camp in Jammu and Kashmir's Pulwama district in India. No casualties were reported.[186]","perpetrator":"Jaish-e-Mohammed","partOf":"Insurgency in Jammu and Kashmir"},{"date":"17","type":"Bombing","dead":"1","injured":"0","location":"Daquq District, Iraq","details":"An Iraqi police commander was killed when a roadside bomb hit his convoy in the village of Albu Najm in the Daquq district of Iraq' s Kirkuk province.[187]","perpetrator":"Islamic State (suspected)","partOf":"Iraqi insurgency"},{"date":"17","type":"Ambush, arson","dead":"30","injured":"Dozens","location":"Ngala, Nigeria","details":"30 persons were killed and dozens were missing when Boko Haram insurgents ambushed a convoy of vehicles along the Dikwa-Ngala road in the local government area of Ngala in the Nigerian state of Borno. The militants also torched 27 vehicles of various sizes and capacity that transported commuters and goods.[188][189]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"18","type":"Shooting","dead":"1","injured":"1","location":"Arroyito, Paraguay","details":"A woman was shot dead and other civilian was injured in an attack in the municipality of Tacuara, Arroyito municipality. The woman was a couple of a Armed Peasant Association militant.[190][191]","perpetrator":"Ejercito del Mariscal Lopez","partOf":"Insurgency in Paraguay"},{"date":"18","type":"Grenade attack","dead":"0","injured":"0","location":"Sopore, India","details":"Militants threw a grenade at a police post in Sopore in Jammu and Kashmir's Baramulla district in India. No fatalities or injuries were reported.[192]","perpetrator":"Jaish-e-Mohammed (suspected)","partOf":"Insurgency in Jammu and Kashmir"},{"date":"18","type":"Bombings, mortar attack","dead":"1","injured":"31","location":"Kirkuk, Iraq","details":"At least one person was killed and 31 others injured when militants attacked different areas in the Iraqi city of Kirkuk with bombs and mortars.[193][194]","perpetrator":"Islamic State (suspected)","partOf":"Iraqi insurgency"},{"date":"18","type":"Shooting","dead":"1","injured":"0","location":"Satipo Province, Peru","details":"A soldier was killed and four terrorists were arrested after security forces raided a subversive camp in the Vizcatan del Ene district of the Satipo province in Peru.[195][196]","perpetrator":"Shining Path","partOf":"Internal conflict in Peru"},{"date":"18","type":"Mortar attack","dead":"0","injured":"0","location":"Al Mahfad District, Yemen","details":"Al-Qaeda militants fired a number of mortar shells at a camp of security forces in the district of Al Mahfad in the Abyan province in Yemen. No casualties were reported.[197]","perpetrator":"Al-Qaeda in the Arabian Peninsula","partOf":"Yemeni Civil War"},{"date":"18","type":"Shooting","dead":"1","injured":"0","location":"Wum, Cameroon","details":"A policeman was killed and decapitated by separatists in Wum, Northwest Region.[198]","perpetrator":"Ambazonia Defence Forces (suspected)","partOf":"Anglophone crisis"},{"date":"18","type":"Shooting","dead":"1","injured":"0","location":"Hormak Rural District, Iran","details":"A member of the Iranian border guard was killed in a gunfight in Lar in the Hormak rural district in the Central district of Zahedan county in the Iranian province of Sistan and Baluchestan.[199][200]","perpetrator":"Jaish ul-Adl","partOf":"Sistan and Baluchestan insurgency"},{"date":"19","type":"Arson","dead":"0","injured":"0","location":"La Araucania Region, Chile","details":"Two attacks were reported in the Araucania Region, the first sector Barros Arana, located 57 kilometers from Temuco, an arson attack left at least one backhoe and a tractor affected, later in the Chacaico sector of Ercilla, another fire left a house consumed by flames. In both incidents were found canvases related with the mapuche cause.[201][202]","perpetrator":"Weichan Auka Mapu","partOf":"Mapuche conflict"},{"date":"19","type":"Arson","dead":"0","injured":"0","location":"Latehar district, India","details":"A school was burned down and destroyed by presumed naxals, in Latehar district, Jarkhand.[203]","perpetrator":"CPI","partOf":"Naxalite–Maoist insurgency"},{"date":"19","type":"Attempted Bombing","dead":"2 (+2)","injured":"+1","location":"Arauquita, Colombia","details":"Two members of the FARC dissidents and a social leader died during the early detonation of an improvised explosive device in the municipality of Arauquita, Arauca Department.[204][205]","perpetrator":"FARC dissidents","partOf":"Colombian conflict"},{"date":"19","type":"Stabbing, shooting, kidnapping","dead":"18","injured":"12","location":"Daboua, Chad","details":"Boko Haram jihadists attacked a village in the south of the sub-prefecture of Daboua in the Lac region of Chad. The attackers slit the throats of two people and shot dead 16 more. Two others were wounded and ten women were abducted by the terrorists, but one was able to flee and return home.[206][207]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"19","type":"Bombing","dead":"0","injured":"1","location":"Chakpikarong, India","details":"An Assam Rifles personnel was injured in a bomb explosion in the Chakpikarong subdivision in Chandel district in the Indian state of Manipur.[208]","perpetrator":"People's Liberation Army of Manipur and Manipur Naga People's Front","partOf":"Insurgency in Manipur"},{"date":"19","type":"Shooting","dead":"0","injured":"0","location":"Sopore, India","details":"Militants fired upon a police team in Sopore in Jammu and Kashmir's Baramulla district in India. No casualties were reported in the incident.[209]","perpetrator":"Hizbul Mujahideen (suspected)","partOf":"Insurgency in Jammu and Kashmir"},{"date":"19","type":"Shooting","dead":"2","injured":"0","location":"Corrin Rural District, Iran","details":"Two members of Iran' s Basij forces were killed in a shootout with armed men in the Corrin rural district in the Kurin district of Zahedan county in the Iranian province of Sistan and Baluchestan.[210]","perpetrator":"Jaish ul-Adl (suspected)","partOf":"Sistan and Baluchestan insurgency"},{"date":"19","type":"Shooting","dead":"12","injured":"0","location":"Imam Sahib District, Afghanistan","details":"Twelve police officers were killed in a Taliban attack in the Imam Sahib district of the northern Afghan province of Kunduz.[211]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"19","type":"Arson","dead":"0","injured":"0","location":"La Uribe, Colombia","details":"A van beloging The Halo Trus Colombia, an NGO dedicated to the demining of the areas affected by the conflict were burned for FARC dissidents in the municipality of Uribe, Meta Department.[212][213]","perpetrator":"FARC dissidents","partOf":"Colombian conflict"},{"date":"20","type":"Suicide bombing","dead":"0 (+1)","injured":"1","location":"Bagrami District, Afghanistan","details":"A child was injured when a suicide bomber blew himself up before reaching his target in the Bagrami district of Kabul province, Afghanistan.[214]","perpetrator":"Islamic State (suspected)","partOf":"War in Afghanistan"},{"date":"20","type":"Shootings","dead":"12","injured":"20","location":"Qarabagh District, Afghanistan","details":"Taliban militants launched a wave of attacks on compounds and police security posts in the Qarabagh district in the eastern Afghan province of Ghazni, killing at least 12 local policemen and injuring 20 others.[215][216]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"20","type":"Kidnapping, shooting","dead":"1","injured":"0","location":"Kulgam district, India","details":"A trainee police constable was kidnapped by militants from the village of Matalhama in the Kulgam district of the Indian state of Jammu and Kashmir. His bullet-ridden body was found later.[217]","perpetrator":"Hizbul Mujahideen","partOf":"Insurgency in Jammu and Kashmir"},{"date":"20","type":"Shooting","dead":"2","injured":"1","location":"Kizilyurtovsky District, Russia","details":"Two police officers were killed and another injured after an attack by insurgents in the village of Stal'skoye in the Kizilyurtovsky district of Dagestan.[218][219]","perpetrator":"Islamic State","partOf":"Insurgency in the North Caucasus"},{"date":"21","type":"Shootings","dead":"2","injured":"0","location":"Rashidan District, Afghanistan","details":"At least two security personnel, including a district police chief, were killed as Taliban fighters attacked security checkpoints in the Rashidan district of Afghanistan's eastern Ghazni province.[220]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"21","type":"Shootings","dead":"11","injured":"8","location":"Marivan County, Iran","details":"At least 11 Iranian Revolutionary Guards were killed and eight others injured in an attack on a post near the city of Marivan in the province of Kurdistan in western Iran.[221][222]","perpetrator":"Kurdistan Free Life Party","partOf":"Western Iran clashes"},{"date":"21","type":"Shooting","dead":"2","injured":"3","location":"Cagayan de Oro, Philippines","details":"An Army lieutenant and a sergeant were killed while three other soldiers were wounded by a landmine explosion planted by militants rebels at the height of skirmishes on Thursday in the hinterland village of San Juan.A military report said the victims were hit when the NPA guerrillas detonated an improvised explosive device (IED) while both camps were engaged in a 20-minute firefight in the subvillage of Bungkulan.[223]","perpetrator":"New People's Army","partOf":"New People's Army rebellion"},{"date":"22","type":"Arson","dead":"0","injured":"0","location":"Pitrufquén, Chile","details":"A group of militants burned a truck crane and a team of napping sounding machinery belonging to a fish farm in sector Mune bajo, Pitrufquén municipality.[224][225]","perpetrator":"Coordinadora Arauco Malleco","partOf":"Mapuche conflict"},{"date":"22","type":"Suicide bombing","dead":"3 (+1)","injured":"3","location":"Kulachi, Pakistan","details":"2018 Kulachi suicide bombing: A suicide bombing in Kulachi in the Dera Ismail Khan district in northwestern Pakistan killed a candidate running for a seat in the provincial assembly, his driver and a guard and injured three other people.[226][227]","perpetrator":"Tehrik-i-Taliban Pakistan","partOf":"War in North-West Pakistan"},{"date":"22","type":"Ambush","dead":"1 (+11)","injured":"4","location":"Macina Cercle, Mali","details":"One soldier and 11 extremists were killed after an ambush in the Macina Cercle of the central Malian Ségou region. Four more troops were wounded in the incident.[228][229]","perpetrator":"Al-Qaeda in the Islamic Maghreb (suspected)","partOf":"Northern Mali conflict"},{"date":"22","type":"Suicide bombing","dead":"23 (+1)","injured":"107","location":"Kabul, Afghanistan","details":"At least 23 people, including an AFP driver, were killed and 107 others injured in a suicide bombing near Kabul International Airport as scores of people were leaving the airport after welcoming home Afghan Vice President Abdul Rashid Dostum from exile.[230]","perpetrator":"Islamic State","partOf":"War in Afghanistan"},{"date":"22","type":"Shooting","dead":"4","injured":"3","location":"Surkh-Rōd District, Afghanistan","details":"An gunman opened fire in a mosque in the Surkh-Rōd district in the eastern Afghan province of Nangarhar, killing four people and injuring three others, including the mosque's religious leader.[231]","perpetrator":"Islamic State (suspected)","partOf":"War in Afghanistan"},{"date":"22","type":"Grenade attack","dead":"0","injured":"30","location":"Dalbandin, Pakistan","details":"At least 30 people were injured in a hand grenade attack on the election office of the Balochistan Awami Party in Dalbandin in the Chagai district of the Pakistani province of Balochistan.[232][233]","perpetrator":"Balochistan Liberation Army","partOf":"Insurgency in Balochistan"},{"date":"23","type":"Suicide bombing","dead":"11 (+1)","injured":"8","location":"Konduga, Nigeria","details":"At least 11 people were killed and eight others injured in a suicide attack on a mosque in the local government area of Konduga in the northern Nigerian state of Borno.[234]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"23","type":"Suicide car bombing, shooting","dead":"5 (+10)","injured":"30","location":"Kismayo District, Somalia","details":"An Al-Shabaab suicide bomber rammed a truck filled with explosives at a military base in a village, about 50 km north of the Somali city of Kismayo. After that, the base was stormed by gunmen. At least five soldiers and ten terrorists were killed and 30 others injured in the attack.[235][236]","perpetrator":"Al-Shabaab","partOf":"Somali Civil War"},{"date":"23","type":"Car bombing","dead":"8","injured":"20","location":"Al-Rai Subdistrict, Syria","details":"Eight people were killed and another 20 injured in a car bomb attack in Bab Laymun near Al-Rai in the Syrian governorate of Aleppo.[237][238]","perpetrator":"Islamic State (suspected)","partOf":"Syrian Civil War"},{"date":"23","type":"Car bombing","dead":"3","injured":"37","location":"Akhtarin, Syria","details":"A car bomb exploded near the local council of Akhtarin in the northern Aleppo governorate in Syria, killing three people and injuring 37 others.[239][240]","perpetrator":"Islamic State (suspected)","partOf":"Syrian Civil War"},{"date":"23","type":"Shooting, grenade attack, hostage taking","dead":"1 (+3)","injured":"5","location":"Erbil, Iraq","details":"Three militants armed with firearms and grenades attacked the offices of the Erbil governorate in Iraq. The attackers injured a police officer before entering the building and then took two persons hostage. Security forces engaged the gunmen, killing all three. Four security members were injured in the raid to retake the building, and one civilian hostage died from the wounds sustained during the incident.[241][242][243]","perpetrator":"Islamic State","partOf":"Iraqi insurgency"},{"date":"24","type":"Arson","dead":"0","injured":"0","location":"Freire, Chile","details":"A group of gunmen attacked and burned a warehouse and agricultural machinery in the commune of Radal, municipality of Freire, La Araucania Region. In the site of the attack were found canvases related with the mapuche cause.[244][245]","perpetrator":"Coordinadora Arauco Malleco (suspected)","partOf":"Mapuche conflict"},{"date":"24","type":"Rocket Attack","dead":"0","injured":"7","location":"Kabul, Afghanistan","details":"At least seven people from one family were wounded in a rocket attack on a civilian area in PD5 in Kabul, the authorities said.[246]","perpetrator":"Taliban (Suspected)","partOf":"War in Afghanistan"},{"date":"24","type":"Shooting","dead":"0","injured":"1","location":"Borongan, Philippines","details":"A government soldier was injured after agunfight against members of the New People's Army in the bangaray Pinanag-an, Borongan, Eastern Samar.[247]","perpetrator":"New People's Army","partOf":"New People's Army rebellion"},{"date":"24","type":"Stabbing, shooting, arson","dead":"2","injured":"4","location":"El Agheila, Libya","details":"Islamic state militants attacked a police station in the Libyan city of El Agheila, slitting a police officer's throat and killing another in a shootout with security forces. Four more people were injured and the attackers also raised the Islamic State flag atop the building and burned several police and ambulance vehicles.[248][249]","perpetrator":"Islamic State","partOf":"Libyan Civil War"},{"date":"24","type":"Ambush","dead":"4","injured":"14","location":"Kech District, Pakistan","details":"Three security forces and one civilian were killed while escorting the polling staff in the Kech district in the Pakistani province of Balochistan. 14 others, including ten security forces, were also injured in the ambush.[250][251]","perpetrator":"Baluch Liberation Front","partOf":"Insurgency in Balochistan"},{"date":"24","type":"Bombing","dead":"4","injured":"5","location":"Aden, Yemen","details":"Four people were killed and five others injured when a bomb exploded as a vehicle was passing near a security checkpoint in Yemen's southern city of Aden.[252]","perpetrator":"Al-Qaeda in the Arabian Peninsula (suspected)","partOf":"Yemeni Civil War"},{"date":"25","type":"Grenade attack","dead":"1","injured":"3","location":"Khuzdar District, Pakistan","details":"Assailants threw a hand grenade at a polling station in a village in the Khuzdar district of Pakistan's Balochistan province, killing one policeman and wounding three others.[253][254]","perpetrator":"Balochistan Liberation Army","partOf":"Insurgency in Balochistan"},{"date":"25","type":"Suicide bombing","dead":"31 (+1)","injured":"40","location":"Quetta, Pakistan","details":"2018 Quetta suicide bombing: At least 31 people, including five policemen and two children, were killed and 40 others wounded after a suicide bomber blew himself up outside a polling station in the Pakistani city of Quetta.[255][256]","perpetrator":"Islamic State","partOf":"War in North-West Pakistan"},{"date":"25","type":"Bombing","dead":"0","injured":"5","location":"Larkana, Pakistan","details":"At least five people were injured in a cracker blast near a polling station in Larkana in the Pakistani province of Sindh.[257][258]","perpetrator":"Sindhudesh Liberation Army","partOf":"Insurgency in Sindh"},{"date":"25","type":"Bombing","dead":"0","injured":"4","location":"Afgooye District, Somalia","details":"A roadside bomb exploded in the village of Ceelasha Biyaha in the Afgooye district of the Lower Shabelle region in Somalia, injuring four soldiers.[259][260]","perpetrator":"Islamic State","partOf":"Somali Civil War"},{"date":"25","type":"Spike Trap","dead":"0","injured":"2","location":"Bijapur, India","details":"At least two CRPF's elite Commando Battalion for Resolute Action (CoBRA) were injured when they carry out an Anti-naxal operation.[261]","perpetrator":"CPI","partOf":"Naxalite–Maoist insurgency"},{"date":"25","type":"Bombing","dead":"6","injured":"Several","location":"Wanlaweyn District, Somalia","details":"At least six government soldiers were killed, while several others were injured when a roadside bomb explosion targeted a military convoy near the town of Wanlaweyn in Somalia's Lower Shabelle region.[262][263]","perpetrator":"Al-Shabaab","partOf":"Somali Civil War"},{"date":"25","type":"Suicide bombings, shootings, hostage taking","dead":"255 (+63)","injured":"180","location":"As-Suwayda Governorate, Syria","details":"2018 As-Suwayda attacks: Islamic state militants carried out suicide bombings and gun attacks in the city of As-Suwayda and a number of villages in the southern Syrian governorate of As-Suwayda, killing 255 people, including 142 civilians, and injuring 180 others. At least 63 terrorists were also killed, including the suicide bombers. The jihadists also seized hostages from the villages they had attacked.[264][265][266]","perpetrator":"Islamic State","partOf":"Syrian Civil War"},{"date":"26","type":"Suicide car bombing","dead":"5 (+1)","injured":"6","location":"Kabul, Afghanistan","details":"A suicide bomber detonated explosives hidden in his vehicle as a National Directorate of Security convoy passed by in the Afghan capital of Kabul, killing four NDS officers and a civilian. Five intelligence officials and one civilian were wounded.[267]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"26","type":"Ambush, arson","dead":"2","injured":"2","location":"Mpeketoni, Kenya","details":"Two police officers were killed and two others sustained serious injuries after Al-Shabaab militants ambushed a police convoy along a road in the area of Mpeketoni in the Lamu county of Kenya. The attackers then burned two police vehicles before fleeing the scene.[268]","perpetrator":"Al-Shabaab","partOf":"Spillover of the war in Somalia"},{"date":"26","type":"Shooting, arson","dead":"6 (+7)","injured":"9 (+Several)","location":"Konduga, Nigeria","details":"At least four soldiers and two mobile policemen were killed and nine civilians wounded when Boko Haram militants attacked a military formation in the village of Jakana in the local government area of Konduga in the Nigerian state of Borno. Seven terrorists were also killed and several of them injured in the gun battle. The attackers also burned down a police station in the area.[269]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"26","type":"Stabbing","dead":"1 (+1)","injured":"2","location":"Geva Binyamin, West Bank","details":"A Palestinian terrorist infiltrated the Israeli settlement of Geva Binyamin in the West Bank and stabbed three people. A father of two small children died and two others were injured in the attack. The assailant was later shot dead.[270]","perpetrator":"Palestinian nationalist","partOf":"Israeli–Palestinian conflict"},{"date":"27","type":"Shooting","dead":"14","injured":"0","location":"Borno State, Nigeria","details":"Islamist militants attacked the checkpoint in the village of Bunari near the garrison town of Monguno in the Nigerian state of Borno, killing three civilians, including a woman and a child, and 11 soldiers. Four military vehicles, including an armoured personnel carrier and a gun car, were carted away by the terrorists.[271]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"27","type":"Landmine","dead":"0","injured":"2","location":"Davao City, Philippines","details":"Two soldiers were injured when a landmine planted for militants detonate in Barangay Tambobong, Baguio district, Davao City.[272]","perpetrator":"New People's Army","partOf":"Communist rebellion in the Philippines"},{"date":"28","type":"Suicide bombing, shooting","dead":"3 (+2)","injured":"8","location":"Jalalabad, Afghanistan","details":"Two security guards and a driver were killed and eight others injured after a suicide bomber detonated his explosives and another attacker stormed into a training center for midwives in Jalalabad, the capital of the Afghan province of Nangarhar. The second terrorist was shot in an hour-long battle with the security forces.[273][274][275]","perpetrator":"Islamic State","partOf":"War in Afghanistan"},{"date":"28","type":"Shooting","dead":"1","injured":"8","location":"Ar-Rutba District, Iraq","details":"A security personnel was killed and eight others injured in an armed attack on a convoy in the Ar-Rutba district of the western Iraqi province of Anbar.[276]","perpetrator":"Islamic State (suspected)","partOf":"Iraqi insurgency"},{"date":"28","type":"Shooting","dead":"+1 (+Unknown)","injured":"+1 (+Unknown)","location":"Ndop, Cameroon","details":"Ndop prison break: At least 50 separatist fighters stormed the premises of the Ndop central prison and broke out central prison and freed 163 inmates.Cameroonian forces were unable to prevent the separatists from burning down the prison.During the raid, the separatists seized weapons and ammunition from the prison before retreating.[277]","perpetrator":"Ambazonia Defence Forces","partOf":"Anglophone  crisis"},{"date":"28","type":"Grenade attack","dead":"0","injured":"4","location":"Awantipora, India","details":"Four CRPF jawans were injured in grenade in Awantipora, Pulwama district, Jammu and Kashmir. The investigations about the incident still ongoing.[278]","perpetrator":"Lashkar-e-Taiba (suspected)","partOf":"Insurgency in Jammu  and Kashmir"},{"date":"28","type":"Shooting, arson","dead":"0","injured":"0","location":"Lafia, Mali","details":"Jihadists set the ballot boxes on fire after firing shots into the sky in the commune of Lafia in the northern Malian region of Tombouctou.[279]","perpetrator":"Al-Qaeda in the Islamic Maghreb (suspected)","partOf":"Northern Mali conflict"},{"date":"29","type":"Kidnapping","dead":"0","injured":"9","location":"Shekh Ali District, Afghanistan","details":"Taliban fighters abducted nine people in the Shekh Ali district of Parwan province in Afghanistan.[280]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"29","type":"Mortar attack","dead":"0","injured":"0","location":"Aguelhok, Mali","details":"Militants fired ten mortar shells around the village of Aguelhok in northern Mali. One exploded near a polling station set up for the presidential election. No casualties were reported.[281][282]","perpetrator":"Al-Qaeda in the Islamic Maghreb","partOf":"Northern Mali conflict"},{"date":"29","type":"Shooting","dead":"1","injured":"0","location":"Mocímboa da Praia District, Mozambique","details":"A soldier was killed in an hour-long intense exchange of gunfire with terrorists in Chiloto in the district of Mocímboa da Praia in the Mozambican province of Cabo Delgado.[283]","perpetrator":"Ansar al-Sunna","partOf":"Islamist insurgency in Mozambique"},{"date":"29","type":"Vehicular attack, stabbing, shooting","dead":"4 (+4)","injured":"2","location":"Danghara District, Tajikistan","details":"Terrorist attack against cyclists in Tajikistan : Two Americans, a Swiss and a Dutch national were killed and two others injured in a terrorist attack in the Danghara district of the Khatlon region in Tajikistan. First a car hit the cyclists and then the occupants of the vehicle got out and stabbed and shot the tourists. Members of the security forces later killed four people suspected of being involved in the attack.[284][285][286]","perpetrator":"Islamic State","partOf":"Terrorism in Tajikistan"},{"date":"30","type":"Bombing","dead":"0","injured":"0","location":"Upi, Philippines","details":"A roadside bomb detonate prematurely in Upi, Maguindanao hurting no one, police said. The authorities blames to the Bangsamoro Islamic Freedom Fighters of being responsible for the attack.[287]","perpetrator":"Bangsamoro Islamic Freedom Fighters","partOf":"Moro conflict"},{"date":"30","type":"Grenade Attack","dead":"0","injured":"3","location":"Anantnag district, India","details":"Militants threw a grenade against CRPF jawans who was on guard duty at a temple in Sherbagh in Anantnag district.[288][289]","perpetrator":"Hizbul Mujahideen (suspected)","partOf":"Insurgency in Jammu and Kashmir"},{"date":"30","type":"Shooting","dead":"4","injured":"0","location":"Hatra District, Iraq","details":"Gunmen belonging to the Islamic State infiltrated into a village in the Hatra district of the Iraqi Nineveh governorate, killing four civilians.[290]","perpetrator":"Islamic State","partOf":"Iraqi insurgency"},{"date":"30","type":"Suicide car bombing","dead":"4 (+1)","injured":"1","location":"Rodat District, Afghanistan","details":"A local tribal elder and three of his family members were killed in a suicide car bomb attack in the Rodat district of the eastern Afghan province of Nangarhar. The son of the tribal leader also suffered minor injuries in the attack.[291][292]","perpetrator":"Islamic State","partOf":"War in Afghanistan"},{"date":"30","type":"Shooting","dead":"10","injured":"1","location":"El Tarra, Colombia","details":"At least nine people were shot dead and other two injurieds during an armed attack against civilians in the municipality of El Tarra, Norte de Santander Department. Days later a wounded victim died from his injuries in a hospital in the city of Cucuta. In November 18th were captured two militants beloging to the \"Los Pelusos\", with relation to the attack.[293][294][295]","perpetrator":"EPL","partOf":"Colombian conflict"},{"date":"30","type":"Kidnapping","dead":"0","injured":"22","location":"Paktia Province, Afghanistan","details":"Taliban militants kidnapped at least 22 passengers from vehicles on the highway connecting Kabul with the city of Gardezin the Afghan province of Paktia.[296]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"30","type":"Shooting","dead":"7 (+4)","injured":"14","location":"Azzaba District, Algeria","details":"Seven soldiers were killed and 14 more injured in a gunfight with militants in the district of Azzaba in the province of Skikda in Algeria. During the shootout, four terrorists were also killed.[297][298][299]","perpetrator":"Al-Qaeda in the Islamic Maghreb","partOf":"Insurgency in the Maghreb"},{"date":"31","type":"Suicide car bombing","dead":"9 (+1)","injured":"12","location":"Lamitan, Philippines","details":"2018 Lamitan bombing: A bomb exploded in a van and killed a suspected bomber, a soldier, four paramilitaries and four civilians, including a mother and her child, at a military checkpoint in the city of Lamitan in the province of Basilan in the southern Philippines. Twelve others were wounded in the attack.[300][301][302][303]","perpetrator":"Abu Sayyaf","partOf":"Moro conflict"},{"date":"31","type":"Bombing","dead":"0","injured":"2","location":"Antipolo, Philippines","details":"An explosive device went off and hit a tricycle carrying two people in Antipoloin the Philippine province of Rizal. Both passengers sustained minor injuries.[304]","perpetrator":"New People's Army","partOf":"CPP–NPA–NDF rebellion"},{"date":"31","type":"Car bombing","dead":"0","injured":"3","location":"Aden, Yemen","details":"At least three people were severely injured when a bomb exploded in a car in the southern Yemeni port city of Aden.[305]","perpetrator":"Al-Qaeda in the Arabian Peninsula (suspected)","partOf":"Yemeni Civil War"},{"date":"31","type":"Kidnapping, shooting","dead":"2","injured":"4","location":"Kohistan District, Afghanistan","details":"Taliban militants kidnapped family members of an uprising commander and killed his wife and a 15-year-old daughter in the Kohistan district in the northern Afghan province of Faryab. Four other children remained in the area with the dead bodies of the mother and daughter.[306]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"31","type":"Bombing","dead":"11","injured":"37","location":"Bala Buluk District, Afghanistan","details":"At least 11 civilians were killed when a roadside bomb hit a bus that was traveling through the Bala Buluk district in the Afghan province of Farah. 37 others were also injured in the explosion.[307][308]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"31","type":"Suicide car bombing, shooting, hostage taking","dead":"14 (+3)","injured":"26","location":"Jalalabad, Afghanistan","details":"A suicide bomber blew up a car near the entrance to the Department of Refugees and Returnees in the Afghan city of Jalalabad and then two armed men stormed the building. The attackers took several hostages during the attack. Security killed both gunmen after about six hours. At least 14 people were killed and 26 others injured in the terrorist attack.[309][310][311][312]","perpetrator":"Islamic State","partOf":"War in Afghanistan"},{"date":"31","type":"Ambush, arson","dead":"6 (+8)","injured":"Several","location":"Niono Cercle, Mali","details":"At least six soldiers and eight militants were killed in an ambush near Nampala in the Niono Cercle of the Malian region of Segou. Several others were wounded and two vehicles of the Malian army and their occupants were missing. The attackers reportedly also set some vehicles on fire.[313][314]","perpetrator":"Al-Qaeda in the Islamic Maghreb","partOf":"Northern Mali conflict"},{"date":"31","type":"Shooting","dead":"0","injured":"3","location":"Wum, Cameroon","details":"Separatist fighters attacked a checkpoint in Wum, injuring three security officers, seizing weapons and setting fire to a gendarmerie vehicle.[315]","perpetrator":"Ambazonia Defence Forces","partOf":"Anglophone  crisis"},{"date":"31","type":"Ambush","dead":"4","injured":"0","location":"Al-Dumayr, Syria","details":"Four regime fighters, including three officers, were killed in an ambush by Islamic State militants in the area of Al-Dumayr, about 50 km from the Syrian capital Damascus.[316]","perpetrator":"Islamic State","partOf":"Syrian Civil War"},{"date":"31","type":"Bombing","dead":"2","injured":"0","location":"Yüksekova, Turkey","details":"A bomb placed by the terrorist organization PKK exploded when a car carrying civilians passed through the district of Yüksekova in the Hakkâri province in Turkey, killing the wife and baby of a Turkish soldier.[317]","perpetrator":"PKK","partOf":"Kurdish–Turkish conflict"}]