[{"date":"1","type":"Suicide bombing","dead":"41","injured":"63","location":"Randi, Iraq","details":"Three suicide bombers in humvees attacked an Iraqi police station in the Tharthar region in Northern Anbar Province. Forty-one security forces were killed along with an sixty-three members wounded. ISIL claimed responsibility for the attack.[1]","perpetrator":"ISIL","partOf":"Iraqi Civil War"},{"date":"2","type":"Stabbing","dead":"0 (+1)","injured":"0","location":"Massachusetts, United States","details":"Police investigating a planned Islamic terrorist attack on police confronted Usaama Rahim to question him. He pulled out a military knife, and was eventually shot and killed by police as he approached them with the knife. David Wright was later arrested and charged with planning a terrorist attack with Usaama Rahim.[2]","perpetrator":"Lone wolf","partOf":"Terrorism in the United States"},{"date":"4","type":"Ambush","dead":"20","injured":"11","location":"Manipur, India","details":"2015 Manipur ambush: The attack, in the Chandel district of Manipur State close to the border with Myanmar, was carried out against a small convoy of army vehicles traveling from one army camp to another in the hilly and forested area about 60 miles south of the state capital, Imphal.[3]","perpetrator":"Unknown","partOf":"Insurgency in Northeast India"},{"date":"7","type":"Arson","dead":"0","injured":"0","location":"Mississauga, Canada","details":"Assailants ignited incendiary devices targeting trucks of Harlan Laboratories in Mississauga, Ontario, Canada. There were no casualties in the attack; however, two trucks were damaged by the fire. Animal Liberation Front claimed responsibility for the incident, stating that the group targeted the company because it supplies animals for laboratory research.[4]","perpetrator":"Animal Liberation Front","partOf":"Terrorism in Canada"},{"date":"8","type":"Suicide bombing, shooting","dead":"7 (+19)","injured":"","location":"North Waziristan, Pakistan","details":"19 militants and seven soldiers were killed by suicide bombing and exchange of gunfire in North Waziristan, Pakistan.[5]","perpetrator":"Unknown","partOf":"War in North-West Pakistan"},{"date":"11","type":"Shooting","dead":"2","injured":"6","location":"Peshawar, Pakistan","details":"Two policemen were killed in an attack by pro-Taliban militants in Peshawar, Khyber Pakhtunkhwa, Pakistan.[6]","perpetrator":"Pakistani Taliban","partOf":"War in North-West Pakistan"},{"date":"13","type":"Suicide bombing","dead":"11","injured":"27","location":"Hajjaj, Iraq","details":"Four suicide SUV car bombs went off in an Iraqi police station in the Hajjaj near Tikrit and Baiji. Eleven security forces were killed along with twenty-seven members wounded. ISIL claimed responsibility for the attack.[7]","perpetrator":"ISIL","partOf":"Iraqi Civil War"},{"date":"15","type":"Suicide bombing","dead":"23","injured":"100","location":"N'Djamena, Chad","details":"Suicide bombers on motorcycles detonated themselves near police headquarters[8] in N'Djamena on the 15th.[9]","perpetrator":"Boko Haram (suspected)","partOf":"Boko Haram insurgency"},{"date":"17","type":"Shooting","dead":"9","injured":"1","location":"Charleston, South Carolina, United States","details":"The Charleston church shooting was a mass shooting and hate crime that took place at the Emanuel African Methodist Episcopal Church. During a prayer service, nine people, were killed by the gunman.","perpetrator":"Dylann Roof","partOf":"Terrorism in the United States"},{"date":"17","type":"Raid","dead":"38","injured":"0","location":"Diffa Region, Niger","details":"At least 38 people were killed by Boko Haram militants in raids on two villages (Ungumawo and Lamina) in Niger's Diffa Region.[10]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"17","type":"Bombing","dead":"63","injured":"","location":"Monguno, Nigeria","details":"Monguno bombing: A large sack containing homemade bombs exploded in Monguno, Nigeria, causing 63 deaths.[11]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"22","type":"Car bomb, Shooting","dead":"9","injured":"40","location":"Kabul, Afghanistan","details":"Kabul Parliament attack: On 22 June 2015, the Taliban detonated a car bomb outside the National Assembly in Kabul, and Taliban fighters attempted to storm the building. Taliban spokesman Zabihullah Mujahid claimed responsibility for the attack, saying that it was timed to coincide with a parliamentary speech of the new defense minister Mohammed Masoom Stanekzai.","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"22–23","type":"Shooting","dead":"42","injured":"0","location":"Borno, Nigeria","details":"More than 42 people are shot dead by suspected Boko Haram gunmen in two attacks on villages in Nigeria's Borno state.","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"23","type":"Suicide bombing","dead":"10","injured":"0","location":"Gujba, Nigeria","details":"A young female suicide bomber (around 12 years of age) killed 10 people in Gujba, Yobe State, Nigeria.[12]","perpetrator":"Unknown","partOf":"Boko Haram insurgency"},{"date":"23","type":"Suicide bombing","dead":"30","injured":"0","location":"Maiduguri, Nigeria","details":"Two female suicide bombers blew themselves up near a crowded mosque in Maiduguri, Nigeria, causing at least 30 deaths.[13]","perpetrator":"Boko Haram (suspected)","partOf":"Boko Haram insurgency"},{"date":"24","type":"Suicide bombing","dead":"6","injured":"6","location":"Mogadishu, Somalia","details":"Al Shabaab militants killed at least six people and injured another six in a suicide car bomb attack on a UAE relief convoy in Mogadishu. Out of the killed, four were civilians, and no UAE official was hurt in the attack.[14]","perpetrator":"Al Shabaab","partOf":"Somali Civil War"},{"date":"25–29","type":"Massacre, Suicide bombing, Hostage-taking","dead":"223–233","injured":"300+","location":"Barkh Butan, Kobani, Syria","details":"Kobanî massacre: On 25 June 2015, ISIL bombers detonated three car bombs in Kobanî, close to the Turkish border crossing.","perpetrator":"ISIL","partOf":"Syrian Civil War"},{"date":"25","type":"Bombing, Mass shooting","dead":"8","injured":"24","location":"Baghdad, Iraq","details":"Five separate bombings and a shooting incident in Baghdad killed at least eight and injured more than two dozen people.[15]","perpetrator":"ISIL (suspected)","partOf":"Iraqi Civil War"},{"date":"25","type":"Bombing","dead":"0","injured":"0","location":"Tumaco, Colombia","details":"An explosion of a trans-Andean oil pipeline in Tumaco by the FARC front 48, resulting in the spill of 410 thousand gallons of crude oil. Considered the \"worst ecological damage of the decade\".[16][17]","perpetrator":"FARC Front 48","partOf":"Colombian conflict"},{"date":"26","type":"Suicide bombing","dead":"20","injured":"0","location":"Hasakeh, Syria","details":"An ISIL suicide bomber killed at least 20 people in the city of Hasakeh.","perpetrator":"ISIL","partOf":"Syrian Civil War"},{"date":"26","type":"Bombing, Beheading","dead":"1","injured":"2","location":"Saint-Quentin-Fallavier, France","details":"Saint-Quentin-Fallavier attack: One attacker decapitated one person and blew up a gas canister in a factory in Saint-Quentin-Fallavier, near Lyon. One person was killed and two were injured. The attacker wrote unknown Arabic writings on the head and placed it near the entrance of the factory. The attackers claimed association with an Islamist organisation, leaving a flag behind. One attacker was killed and the other arrested.[18]","perpetrator":"ISIL","partOf":"Wave of Terror in Europe"},{"date":"26","type":"Suicide bombing","dead":"27 (+1)","injured":"227","location":"Kuwait City, Kuwait","details":"2015 Kuwait mosque bombing: At least 27 people are killed and another 227 were injured after a suicide bombing at the Imam Sadiq mosque in Kuwait City, Kuwait.[19]","perpetrator":"ISIL","partOf":""},{"date":"26","type":"Mass shooting","dead":"38 (+1)","injured":"40","location":"Sousse, Tunisia","details":"Sousse attacks: In the Tunisian town of Sousse, 38 people (mostly Western tourists, with the majority being British) were killed by armed gunmen. ISIL claimed responsibility.[20] The main gunman was killed in an exchange of gunfire with the army and armed police.","perpetrator":"ISIL","partOf":"ISIL insurgency in Tunisia"},{"date":"26","type":"Attack","dead":"70","injured":"27","location":"Leego, Somalia","details":"Battle of Leego (2015): Al Shabaab militants attack an African Union base in the Leego district of Somalia and kills more than 70 African Union soldiers and seizes control of their military base.[21]","perpetrator":"Al Shabaab","partOf":"Somali Civil War"},{"date":"27","type":"Shooting","dead":"3 (+8)","injured":"0","location":"Nara, Mali","details":"Suspected Islamist militants attacked an army base in Nara, Mali leaving three soldiers and eight attackers dead.","perpetrator":"Unknown","partOf":"Insurgency in the Maghreb"},{"date":"27","type":"Bombing","dead":"12","injured":"34","location":"Baghdad, Iraq","details":"A series of bombs across Baghdad killed at least 12 people and injured 34 people. ISIL is suspected to be responsible for the attacks.[15]","perpetrator":"ISIL (suspected)","partOf":"Iraqi Civil War"},{"date":"28","type":"Suicide bombing","dead":"5","injured":"15","location":"Maiduguri, Nigeria","details":"Two female suicide bombers blew themselves up causing at least five deaths and injuries to 15 others near a hospital in Maiduguri, Nigeria.[22]","perpetrator":"Boko Haram (suspected)","partOf":"Boko Haram insurgency"},{"date":"29","type":"Bombing","dead":"11","injured":"0","location":"N'Djamena, Chad","details":"Five Chadian security officials and six militants was killed during an explosion in a raid in the capital N'Djamena.","perpetrator":"Unknown","partOf":""},{"date":"29","type":"Car bomb","dead":"28","injured":"0","location":"Sana'a, Yemen","details":"A car bomb explodes behind a military hospital in the Yemeni capital Sanaa causing 28 casualties. ISIL has claimed responsibility.","perpetrator":"ISIL","partOf":"Iraqi Civil War"},{"date":"29","type":"Shooting","dead":"1","injured":"3","location":"Shilo, West Bank","details":"2015 Shvut Rachel shooting: Four Israelis were shot and injured in a drive-by shooting attack near Shilo. One of them died in hospital in the day after. The PFLP and Hamas both claimed responsibility for the act, but official investigation attributed the shooting to Hamas.[23][24]","perpetrator":"PFLP","partOf":"Israeli–Palestinian conflict"},{"date":"29","type":"Car bomb","dead":"1","injured":"4","location":"Cairo, Egypt","details":"Assassination of Hisham Barakat: Egypt's state prosecutor Hisham Barakat was killed by a remotely detonated car bomb in Cairo, Egypt. Two civilians and two police officers were injured by the attack.[25]","perpetrator":"Unknown","partOf":""},{"date":"30","type":"Shelling","dead":"0","injured":"0","location":"Balochistan, Pakistan","details":"Assailants fired a rocket at a Frontier Corps checkpoint in Hoshab, Balochistan province, Pakistan. There were no reported casualties in the blast. No group claimed responsibility for the attack.[26]","perpetrator":"Unknown","partOf":"Balochistan insurgency"},{"date":"30","type":"Suicide bombing","dead":"2","injured":"51","location":"Lashkar Gah, Afghanistan","details":"A suicide car bomb near the police headquarters in Lashkar Gah, Afghanistan killed two civilians and injured 51.[27]","perpetrator":"Unknown","partOf":"War in Afghanistan"},{"date":"30","type":"Suicide bombing","dead":"1","injured":"22","location":"Kabul, Afghanistan","details":"A suicide car bomb targeting an international convoy killed one civilian and wounded 22 others in Kabul, Afghanistan. Taliban claimed responsibility for the attack.[27]","perpetrator":"Taliban","partOf":"War in Afghanistan"},{"date":"30","type":"Arson","dead":"1(+1)","injured":"20+","location":"Kanagawa, Japan","details":"A man has burnt himself to death at shinkansen(bullet train). It caused that a woman is killed and 20+ people are injured.[28][29]","perpetrator":"Unknown","partOf":""}]