[{"date":"1","type":"Bombing","dead":"0","injured":"18","location":"Polomolok, South Cotabato, Philippines","details":"Unknown militants detonated an improvised explosive device inside a passenger bus in Polomolok, southern Philippines. 18 people were left injured. Abu Sayyaf is suspected in the attack due to its history of bombings in the area.[1][2]","perpetrator":"Abu Sayyaf (suspected)","partOf":"Moro Conflict"},{"date":"1","type":"Bombing","dead":"4","injured":"6","location":"Isabela City, Basilan, Philippines","details":"Unknown militants have placed an explosive device on a motorcycle taxi and detonated it at a convoy of Vice Mayor Abdubaki Ajibon of Isabela City. The blast killed Abdubaki Ajibon's driver, another passenger and two pedestrians, 6 others were wounded. Abdubaki Ajibon was reported unhurt. Abu Sayyaf is suspected in the attack due to its history of bombings in the area.[1][2]","perpetrator":"Abu Sayyaf (suspected)","partOf":"Moro Conflict"},{"date":"1","type":"Shooting","dead":"2","injured":"0","location":"West Bank","details":"Murder of Eitam and Na'ama Henkin: Five of a Hamas terrorist cell in the West Bank killed Eitam and Naama Henkin, parents of a Jewish family driving home from a meeting of yeshiva graduates, on a road near Nablus in the northern West Bank. Their four children, who were sitting in the car's back seat, were unhurt.[3][4] The attackers were caught and confessed their crimes on 5 October 2015.[5]","perpetrator":"Hamas affiliated cell","partOf":"Israeli–Palestinian conflict"},{"date":"1","type":"Attack","dead":"4","injured":"7","location":"Mardin, Turkey","details":"Four Turkish soldiers were killed in PKK attacks across southeastern Turkey.[6]","perpetrator":"PKK","partOf":"Kurdish–Turkish conflict"},{"date":"2","type":"Shooting","dead":"1 (+1)","injured":"0","location":"Parramatta, Sydney, Australia","details":"2015 Parramatta shooting: 15-year-old Farhad Khalil Mohammad Jabar shot dead an unarmed civilian police employee, working in finance, outside the NSW Police headquarters on Charles Street in Parramatta, New South Wales. The shooter was fatally shot by responding special constables after firing on them.[7]","perpetrator":"Farhad Khalil Mohammad Jabar (lone wolf)","partOf":"Terrorism in Australia"},{"date":"2","type":"Suicide bombing","dead":"18","injured":"41","location":"Abuja, Nigeria","details":"Male and female suicide bombers detonated their bombs outside a police station and a bus stop in Abuja, Nigeria's capital. Eighteen were killed with 41 wounded.[8]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"3","type":"Melee attack, shooting","dead":"2 (+1)","injured":"2","location":"East Jerusalem","details":"Lions' Gate stabbing: Mohannad Hallabi (age 19) stabbed four people. He then took a firearm from one of the wounded and started shooting at civilians and police officers who shot back and killed him. Two men died from stab wounds, a woman and her two-year-old toddler were wounded. The incident occurred in the Old City of Jerusalem.[9][10]","perpetrator":"Mohannad Hallabi(lone wolf)","partOf":"Israeli–Palestinian conflict"},{"date":"4","type":"Melee attack","dead":"0 (+1)","injured":"1","location":"East Jerusalem","details":"Fadi Aloon stabbed a 15-years-old Jewish teenager near Damascus Gate in Jerusalem, leaving him with moderate wounds. The attacker was shot and killed by police officers.[11] Palestinians cast doubts on the Israeli report that Alon tried to stab a Jew. Based on a video they claimed that a group of Jews attacked him and called on the police to shoot him without reason.[12]","perpetrator":"Fadi Aloon (lone wolf)","partOf":"Israeli–Palestinian conflict"},{"date":"4","type":"Suicide bombing","dead":"8","injured":"11","location":"Diffa, Niger","details":"A suicide bomber blew himself up when confronted by a police officer in Diffa. The police officer and six civilians were killed in the attack which wounded eleven other civilians. One suspect in a group associated with the bomber was shot and killed while fleeing police forces and two more were arrested. Boko Haram is suspected in the attack.[13]","perpetrator":"Boko Haram (suspected)","partOf":"Boko Haram insurgency"},{"date":"5","type":"Suicide bombing, car bomb","dead":"57","injured":"Unknown","location":"Baghdad, Iraq","details":"Thirty-five people were killed after a car bomb parked outside a crowded market in Khalis exploded. The town is fifty miles outside Baghdad, Iraq. Also, in Al Zubair ten were killed along with twelve more killed in the Hussainiya district in other attacks. Islamic State claimed responsibility for the attacks.[14]","perpetrator":"Islamic State","partOf":"Iraq War"},{"date":"7","type":"Suicide bombing","dead":"7","injured":"3","location":"Sana'a, Yemen","details":"An Islamic State suicide bomber detonated himself on a group of Houthi rebels in a mosque in Sana'a. The blast killed seven and left three wounded, the Houthi rebels report.[15]","perpetrator":"Islamic State","partOf":"Yemeni Civil War"},{"date":"7","type":"Melee attack","dead":"0","injured":"1 (+1)","location":"East Jerusalem","details":"18-year-old Palestinian woman attacked an Israeli man with a knife near the Lions' Gate. The victim was able to draw his gun and shoot his attacker. Both were hospitalized; both were expected to live.[16][17]","perpetrator":"(lone wolf)","partOf":"Israeli–Palestinian conflict"},{"date":"7","type":"Melee attack","dead":"0 (+1)","injured":"1","location":"Kiryat Gat, Israel","details":"Amjad al Jundi (18) stabbed an Israeli soldier and snatched his rifle, leaving him with light wounds. He then entered an apartment in a nearby building, trying to attack a woman. When finding out there were no bullets in the rifle, he picked a knife from the kitchen and the woman fled the apartment. Police entered and shot him dead. The attacker was illegally staying in Israel and Hamas confirmed he is a member of the organization.[18][19]","perpetrator":"Amjad al Jundi (of Hamas)","partOf":"Israeli–Palestinian conflict"},{"date":"7","type":"Melee attack","dead":"0","injured":"1","location":"Petah Tikwa, Israel","details":"Tamer Yunis Ahmed (25), resident of the West Bank, stabbed an Israeli man outside an entrance to a large mall in Petah Tikwa, leaving him with light wounds. The attacker was overpowered by civilians and was arrested by the police.[20]","perpetrator":"Tamer Yunis Ahmed (Lone wolf)","partOf":"Israeli–Palestinian conflict"},{"date":"8","type":"Melee attack","dead":"0","injured":"1","location":"East Jerusalem","details":"Subhi Ibrahim Mohammed Abu Khalifa (19) stabbed a Jewish man in his upper body, leaving him seriously injured. Another man confronted him and was wounded as well. The assailant was arrested by Yasam forces.[21]","perpetrator":"Subhi Ibrahim Mohammed Abu Khalifa (Lone wolf)","partOf":"Israeli–Palestinian conflict"},{"date":"8","type":"Melee attack","dead":"0 (+1)","injured":"4","location":"Tel Aviv, Israel","details":"Tair Abu Gazala (19) from East Jerusalem stabbed four people using a screwdriver near HaHagana Station in Tel Aviv, leaving them with light wounds. An IDF soldier shot and killed him.[22]","perpetrator":"Tair Abu Gazala (Lone wolf)","partOf":"Israeli–Palestinian conflict"},{"date":"8","type":"Melee attack","dead":"0","injured":"1","location":"Kiryat Arba, West Bank","details":"Unidentified man stabbed a Jewish man in Kiryat Arba settlement in the West Bank, leaving him with serious wounds. The attacker fled the scene and IDF soldiers begun searching for him.[23]","perpetrator":"Palestinian Lone wolf (suspected)","partOf":"Israeli–Palestinian conflict"},{"date":"8","type":"Melee attack","dead":"0","injured":"2","location":"Afula, Israel","details":"Tarak Yahya (20) stabbed two people in Afula, leaving them with light wounds. Civilians that were in the scene overpowered the attacker and police arrested him.[24]","perpetrator":"Tarak Yahya (Lone wolf)","partOf":"Israeli–Palestinian conflict"},{"date":"9","type":"Melee attack","dead":"0","injured":"4","location":"Dimona, Israel","details":"Unidentified seventeen-year-old Jewish teen with psychiatric history stabbed four Bedouin Arab, leaving two with moderate wounds and two with minor wounds. He was arrested by the police.[25]","perpetrator":"Jewish teen (Lone wolf)","partOf":"Israeli–Palestinian conflict"},{"date":"9","type":"Melee attack","dead":"0","injured":"1","location":"Kiryat Arba, West Bank","details":"A Palestinian man stabbed a forty-seven-year-old Israeli police officer during a security check, leaving him with light wounds. The attacker fled the scene and soldiers are searching for him.[26]","perpetrator":"Palestinian lone wolf","partOf":"Israeli–Palestinian conflict"},{"date":"9","type":"Melee attack","dead":"0","injured":"1","location":"East Jerusalem","details":"Unknown attacker stabbed a sixteen-year-old Jewish teen in East Jerusalem, leaving him with minor wounds. An Arab from the city was arrested on suspicion of perpetrating the attack.[26]","perpetrator":"Palestinian lone wolf (suspected)","partOf":"Israeli–Palestinian conflict"},{"date":"10","type":"Suicide bombing","dead":"102","injured":"508","location":"Ankara, Turkey","details":"2015 Ankara bombings: Two suicide bombers blew themselves up near Ankara central station where a rally for peace supported by HDP was taking place.[27] The attack left 102 dead[28] and 508 injured.[29]","perpetrator":"Islamic State","partOf":"Turkey–ISIL conflict"},{"date":"10","type":"Melee attack","dead":"0 (+1)","injured":"2","location":"East Jerusalem","details":"Ishak Badran (16) stabbed two Jews in their sixties in East Jerusalem, leaving them with light and moderate wounds. He then rushed toward Israeli police officers who ordered him to halt and was shot dead.[30]","perpetrator":"Ishak Badran (lone wolf)","partOf":"Israeli–Palestinian conflict"},{"date":"10","type":"Melee attack","dead":"0 (+1)","injured":"3","location":"East Jerusalem","details":"Muhammad Ali (19) stabbed two Israeli policemen near Damascus Gate in East Jerusalem, moderately injuring them. He was shot dead by other policemen and during the take down another Israeli policemen was seriously injured from friendly fire.[31]","perpetrator":"Muhammad Ali (lone wolf)","partOf":"Israeli–Palestinian conflict"},{"date":"10","type":"Suicide bombing","dead":"38","injured":"51","location":"N'Djamena, Chad","details":"Two groups of suicide bombers attacked a refugee center in N'Djamena and a market in Baga Sola, Chad. Thirty-eight were killed and fifty-one wounded. Boko Haram is suspects in the attacks.[32]","perpetrator":"Boko Haram suspected","partOf":"Boko Haram insurgency"},{"date":"11","type":"Shooting","dead":"1 (+1)","injured":"1","location":"Omeath, Republic of Ireland","details":"Two were killed, including an on-duty police officer and one person injured following a shooting incident in Omeath. A man who faced charges of membership of a dissident republican organisation and was out on bail opened fire on a police petrol. The gunman was also killed. Police was called following reports of a dispute at a house.[33]","perpetrator":"New IRA","partOf":"Dissident republican campaign"},{"date":"11","type":"Bombing, stabbing","dead":"0","injured":"5","location":"Highway 65, West Bank","details":"Four Israelis were stabbed and wounded by an Israeli-Arab, another police officer was wounded by a driver-detonated bomb the morning after.[34]","perpetrator":"lone wolf","partOf":"Israeli–Palestinian conflict"},{"date":"12","type":"Suicide bombing","dead":"9 (+2)","injured":"unknown","location":"Kangaleri, Cameroon","details":"Two suicide bombers blew themselves up in a restaurant in the north of Cameroon.[35]","perpetrator":"Boko Haram suspected","partOf":"Boko Haram insurgency"},{"date":"13","type":"Melee attack","dead":"0","injured":"1 (+1)","location":"Ra'anana, Israel","details":"A Palestinian man stabbed an Israeli man in a bus station near the city hall of Ra'anana, leaving him with light stab wounds. Civilians overpowered the attackers and he was arrested by the police.[36]","perpetrator":"Palestinian lone wolf","partOf":"Israeli–Palestinian conflict"},{"date":"13","type":"Shooting, melee attack","dead":"3 (+1)","injured":"15 (+1)","location":"East Jerusalem","details":"Baha Aliyan (22) and Bilal Ranem (23), armed with a firearm and a knife boarded a bus in East Jerusalem and started attacking and stabbing the passengers. One of the assailants tried to take control on the bus and locked the bus door to prevent the passengers from escaping. Police arrived, killed one of the assailants and neutralized the other, who left two dead and sixteen wounded.[36][37] Another man succumbed to his wounds on 27 October 2015.[38]","perpetrator":"Baha Aliyan and Bilal Ranem ()","partOf":"Israeli–Palestinian conflict"},{"date":"13","type":"Vehicular assault, melee attack","dead":"1 (+1)","injured":"4","location":"Jerusalem, Israel","details":"Alaa Abu Jamal rammed into a crowd of people waiting in a bus station in West Jerusalem, then went out of the vehicle and started stabbing the victims until he was neutralized by a security guard and was killed. One Rabbi died and another four people were injured, others were treated for anxiety.[36]","perpetrator":"Alaa Abu Jamal (lone wolf)","partOf":"Israeli–Palestinian conflict"},{"date":"13","type":"Melee attack","dead":"0","injured":"4 (+1)","location":"Ra'anana, Israel","details":"A Palestinian man stabbed four people in a bus stop in Ra'anana and fled the scene when he was caught by civilians who neutralized him and the police arrested him.[36]","perpetrator":"Palestinian lone wolf","partOf":"Israeli–Palestinian conflict"},{"date":"13","type":"Melee attack","dead":"0","injured":"1","location":"Kiryat Ata, Israel","details":"A Jewish man searched for Arabs near IKEA shop in Kiryat Ata and stabbed a man who he thought was an Arab but was Jewish, leaving him with moderate wounds. The attacker was subdued and the police arrested him.[36]","perpetrator":"Israeli Jewish lone wolf","partOf":"Israeli–Palestinian conflict"},{"date":"14","type":"Melee attack","dead":"0 (+1)","injured":"1","location":"East Jerusalem","details":"Ahmed Shaaban (23) stabbed a 50-year-old woman in East Jerusalem, leaving her with moderate to serious injuries. He then tried to board a bus but was shot dead by police.[39]","perpetrator":"Ahmed Shaaban (23) (lone wolf)","partOf":"Israeli–Palestinian conflict"},{"date":"14","type":"Suicide bombing","dead":"42","injured":"0","location":"Maiduguri, Nigeria","details":"A suicide bomber detonated his bomb in a mosque around Molai area of Maiduguri.[40]","perpetrator":"Boko Haram","partOf":"Boko Haram insurgency"},{"date":"16","type":"Melee attack","dead":"5 (+1)","injured":"4","location":"Saihat, Saudi Arabia","details":"An Islamist militant opened fire at Shias who were attending a religious mourning ceremony at the religious center in Saihat, Saudi Arabia, killed five, injured another four and was shot dead during a gun fight with security forces. Islamic State claimed responsibility for the attack but Saudi security forces said the attack was made by \"Saudi nationals\"[41]","perpetrator":"Islamic State or Saudi nationalists","partOf":""},{"date":"7","type":"Shooting","dead":"0","injured":"0","location":"Strabane, Northern Ireland","details":"Gunmen opaned fire on a police station in Strabane. No one killed are injured in the incident. The New IRA claimed responsibility for the attack.[42][43]","perpetrator":"New Irish Republican Army","partOf":"Dissident Irish Republican campaign"},{"date":"18","type":"Shooting","dead":"2 (+1)","injured":"11","location":"Be'er Sheva, Israel","details":"Beersheva bus station shooting: Muhand al-Okabi, an Israeli Bedouin shot and killed an Israeli soldier with a firearm in Be'er Sheva main Bus station. He then picked the soldier's rifle and clashed with other armed guards and soldiers, wounding a total of 10, four cops among them. Police accidentally shot an Eritrean man who was presumed to be a second attacker, possibly because of his skin-color. Locals beat him and he later died.[44][45] According to Negev police the attacker had been in contact with Hamas for a long time. However Israeli intelligence officials said they were not aware of any contact with Hamas or any orchestration by Hamas of the attack.[46]","perpetrator":"Muhand al-Okabi (lone wolf)","partOf":"Israeli–Palestinian conflict"},{"date":"19","type":"Bus bombing","dead":"11","injured":"22","location":"Quetta, Pakistan","details":"2015 Quetta bus bombing: At least 11 people were killed and another 22 were wounded after a bomb exploded in a bus in Quetta, Balochistan.[47][48][49]","perpetrator":"Unknown","partOf":"Balochistan conflict"},{"date":"19","type":"Kidnapping","dead":"2","injured":"","location":"Bhutan, Philippines","details":"Loreto Mayor Dario Otaza and his son Daryl were kidnapped and killed by the New People's Army (NPA). The militant group says that Otaza and his son were guilty of war crimes, crimes against humanity and other human rights violations. Otaza was also a former NPA commander and a Lumad himself and has been advocating against the armed struggle and for the reintegration of NPA rebels to mainstream society. 19 NPA members has been criminally charged for the incident.[50][51]","perpetrator":"New People's Army","partOf":"Communist rebellion in the Philippines"},{"date":"22","type":"Vandalism","dead":"0","injured":"0","location":"Athens, Greece","details":"Members of C-18 group, (Combat 18 Hellas is a small neo-Nazi group which operates in Greece) who took responsibility for the incident of vandalized in the cemetery and later posting a blog post on their website about their “beautiful artistic intervention”.They warned that they were planning on revisiting the cemetery in order to “do it again”.[52]","perpetrator":"Combat 18 Hellas","partOf":"Terrorism in Greece"},{"date":"22","type":"Melee attack","dead":"3 (+1)","injured":"1","location":"Trollhättan, Sweden","details":"Trollhättan school attack: 21-year-old Anton Lundin Pettersson attacked Kronan School in Trollhättan, Sweden, with a sword. He killed a teaching assistant and a male student, stabbed another male student and a teacher, and died later of the gunshot wounds he received during his apprehension. The second teacher who was wounded died in hospital six weeks after the attack, on 3 December.","perpetrator":"Anton Lundin Pettersson","partOf":"Terrorism in Sweden"},{"date":"23","type":"bombing","dead":"11","injured":"10","location":"Maiduguri, Nigeria","details":"Militants detonated a bomb at a Mosque during dawn prayers in Maiduguri in northeast Nigeria, killing 11 and wounding another 10 people. Boko Haram is suspected for the attack.[53]","perpetrator":"Boko Haram (suspected)","partOf":"Boko Haram insurgency"},{"date":"23","type":"Bombing","dead":"0","injured":"4","location":"Giza, Egypt","details":"Four people including two Egyptian policemen were wounded Friday in a failed attempt to dismantle a bomb outside a Cairo hotel near the pyramids, a security official said.\nTwo policemen and two hotel security guards were wounded as they tried to deactivate the explosive device found by security guards outside the Meridien hotel near the Giza pyramids, he said.[54]\n","perpetrator":"Islamic State","partOf":"Sinai insurgency"},{"date":"23","type":"Bombing","dead":"27","injured":"96","location":"Yola, Nigeria","details":"Militants detonated a bomb at a parking lot next to a recently built Mosque during Friday prayers in Yola in northeast Nigeria, killing 27 wounded another 96 people. Boko Haram is suspected for the attack.[53]","perpetrator":"Boko Haram (suspected)","partOf":"Boko Haram insurgency"},{"date":"23","type":"Suicide bombing","dead":"22","injured":"40+","location":"Jacobabad, Pakistan","details":"A suicide bomber detonated himself at a religious procession for a Shiite Muslim holiday. The blast killed 22 people, at least five kids among them. Over 40 were wounded. No group have claimed responsibility for the attack.[55][56]","perpetrator":"Unknown","partOf":"Sectarianism in Pakistan"},{"date":"24","type":"Bombing","dead":"1","injured":"50–80","location":"Dhaka, Bangladesh","details":"Islamic State detonated three bombs at a building full with Shias who were preparing for the Mourning of Muharram in Bangladesh's capital, Dhaka. One fourteen-years-old teen was killed and around 50-80 were wounded. Official said that there were some 20,000 people in and outside the building at that time. The attack is the considered to be the first attack against Bangladesh's tiny Shia community.[57]","perpetrator":"Islamic State","partOf":"Internal conflict in Bangladesh"},{"date":"26","type":"Suicide bombing","dead":"2","injured":"19","location":"Najran, Saudi Arabia","details":"Islamic State suicide bomber detonated himself in a Shia in Al-Mashhad mosque in Najran. Two men were killed in the blast and another 19 people were wounded. It is not known if the attacker was killed or not. Islamic State announced they targeted Isma'ilis.[58][59]","perpetrator":"Islamic State","partOf":""},{"date":"26","type":"Melee attack","dead":"0 (+1)","injured":"1","location":"Near Hebron, West Bank","details":"A Palestinian man stabbed an Israeli, leaving him with a serious wound. The attacker was shot dead by the police.[60]","perpetrator":"Palestinian lone wolf","partOf":"Israeli–Palestinian conflict"},{"date":"27","type":"Suicide bombing","dead":"7","injured":"19","location":"Baghdad, Iraq","details":"Abu Thabit detonated his explosive belt at a tent serving refreshments to Shiite pilgrims. The blast killed seven (including two policemen) and left 19 wounded. Islamic State claimed responsibility.[61]","perpetrator":"Islamic State","partOf":"Iraqi Civil War"},{"date":"27","type":"Melee attack","dead":"0","injured":"1","location":"West Bank","details":"A Palestinian man stabbed an Israeli woman in Gush Etzion in the West Bank, leaving her with moderate wounds. The attacker was later arrested by the police.[62]","perpetrator":"Palestinian lone wolf","partOf":"Israeli–Palestinian conflict"},{"date":"29","type":"Melee attack","dead":"0 (+1)","injured":"1","location":"Hebron, West Bank","details":"A Palestinian man stabbed an Israeli soldier, leaving him with light wounds. The attacker was shot dead by the police.[63]","perpetrator":"Palestinian lone wolf","partOf":"Israeli–Palestinian conflict"},{"date":"30","type":"Melee attack","dead":"0 (+1)","injured":"2","location":"East Jerusalem","details":"A Palestinian man stabbed a person in East Jerusalem, leaving him with moderate wounds. A man who confronted the attacker was injured by police gunfire and the attacker was killed by police.[64]","perpetrator":"Palestinian (lone wolf)","partOf":"Israeli–Palestinian conflict"},{"date":"31","type":"Rocket","dead":"6","injured":"4","location":"Achin, Afghanistan","details":"Suspected Islamic State militants fired a rocket at a mosque in Achin District, Afghanistan, killing six and wounding another four.[65]","perpetrator":"Islamic State (suspected)","partOf":"War in Afghanistan"},{"date":"31","type":"Bombing","dead":"224","injured":"0","location":"Sinai, Egypt","details":"Islamic State affiliated Wilayah Sayna militants have claimed destruction of Metrojet Flight 9268. It was later confirmed that the aircraft had been bombed.[66]","perpetrator":"Islamic State","partOf":"Sinai insurgency"},{"date":"31","type":"Melee attack, shooting","dead":"1","injured":"3","location":"Dhaka, Bangladesh","details":"Two attacks were made on secular publishing houses in the Bangladeshi capital of Dhaka.[67][68] In the first attack, Ahmed Rahim Tutul of the Shudhdhoswar publishing house was critically injured, and two writers suffered less serious wounds.[67] In the second attack, Faisal Arefin Deepan of the Jagriti Prokashoni publishing house was hacked to death in his office.[67][68] The day after the attack, teachers, intellectuals and students rallied at Dhaka University to protest the attacks.[67] on the same day, publisher Farid Ahmed of Somoy publishing house received a death threat for publishing the works of atheist authors.","perpetrator":"Ansar al-Islam claimed responsibility (not verified); police suspect the banned Islamic extremist group Ansarullah Bangla Team[67]","partOf":"Attacks on secularists in Bangladesh"}]